Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
/********************************************************
 * 版权：苏州欧姆尼克新能源科技有限公司软件组
 * 文件名称：Display.c
 * 修改人：沈仕强
 * 修改日期：2019.06.20
 * 描述：显示控制
 *******************************************************/

#define version "V1.0.5"
/********************************************************************
 * Include Files
 ********************************************************************/
#include <stdio.h>
#include "App.h"
#include "stm32f0xx_gpio.h"
#include "I2C.h"
#include "Lib_Communication.h"
#include "Lib_Country.h"
#include "Display.h"
#include "InterfaceDef.h"
#include "string.h"
#include "Lib_SelfTest.h"
#include "Lib_ClearRam.h"
#include "MF_Datecfg.h"
#include "HF_Datecfg.h"
#include "Variable_Transformation.h"
#include "modbus.h"
#include "Led_State.h"
/********************************************************************
 * Macros
 ********************************************************************/
#define c5sDisplay	500  //屏幕刷新延时

/********************************************************************
 * Constant
 ********************************************************************/
const INT32U c10Time[9] = {1,10,100,1000,10000,100000,1000000,10000000,100000000};


/********************************************************************
 * Local Types
 ********************************************************************/
INT8U lubButtonOffCnt[4];
INT8U lubButtonOnCnt[4];
INT8U lubSpeakerflag;
INT8U lubSpeakerOnCnt;
INT8U lubResetCnt;
INT8U lubRefreshCnt;
INT8U lubScreenBuf[cMaxLine][cMaxRow];
INT8U lubIconSelected;
INT8U lubBlinkCnt;
INT8U lubLanguageSet;
INT8U lubPasswordSet[6] = {0x30,0x30,0x30,0x30,0x30,0x30};
INT8U lubPasswordIn[6] = {0x30,0x30,0x30,0x30,0x30,0x30};
INT16U lubInterface;
INT16U lubInterfacePre;
INT8U lubLongPressCnt[4];
INT8U lubString[21];
INT8U lubStringTemp[21];
INT8U lubPageFlg;
INT8U lubFreqOrPfFlg;
INT16U lubPowerFactor;
INT8U lubMaxSetListTemp;
INT16U luwVoltSet[9];
INT16U luwFreqSet[8];
INT16S luwParamSet[7];
INT16S luwParamSetMax[7];
INT16S luwParamSetMin[7];
INT16U luwProtectionSet[15];
INT16U luwProtectionSetMax[15];
INT16U luwProtectionSetMin[15];
INT16U luwCurveSet[10];
INT16U luwCurveSetMax[10];
INT16U luwCurveSetMin[10];
INT16S luwKeyDataSet[4];
INT16S luwKeyDataSetMax[4];
INT16S luwKeyDataSetMin[4];
INT16U luwInvSet[2];
INT16U luwInvSetMax[2];
INT16U luwInvSetMin[2];
INT16U luwNoOprateCnt;
INT16U luwBusyCheckCnt;
INT16U luwAutoTestCnt;
INT16U luwFreqSetMin[8];
INT16U luwFreqSetMax[8];
INT16U luwUpdateSuccessCnt;
BUTTON Button;
SYSTEMTIME TimeSet;
FLASH_FRAME_Typedef m_frame_info;

/********************************************************************
 * Extern Global Types
 ********************************************************************/
extern INT8U *gubBlockPtr[cMaxBlockNum];
extern const INT16U cMaxLength[cMaxBlockNum];
/********************************************************************
 * Functions
 *******************************************************************/
INT8U sGetButtonState(INT8U i);
void sButtonPressCheck(void);
void sChooseInterface(void);
void sUpdateLCD(void);
void sDisplayAsist(INT8U lubMin,INT8U lubMax,INT8U *lubStringAsist);
void sDelay(INT16U i);
void sWriteScreenBuf(INT8U lubLine,INT8U lubRow,INT8U lubLength,INT8U *lubDataAdr);
void sWriteLCDAdr(INT8U lubLCDAdr);
void sTransferData(INT8U lubDot,INT32U lulData,INT8U *lubDataP,INT8U lubLength);
void sAutoTestAsis(INT8U lubModel);

INT8U sGetLCDState(void);
INT16U sAutoTestAsis1(INT8U lubModel,INT8U lubItem,INT16U luwValue);
/*****************************************************************************
 * 函数名称：按键状态获得函数
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
INT8U sGetButtonState(INT8U i)
{
	if(i == 0)
	{
		return(cGetButtonEsc());
	}
	else if(i == 1)
	{
		return(cGetButtonEnter());
	}
	else if(i == 2)
	{
		return(cGetButtonUp());
	}
	else if(i == 3)
	{
		return(cGetButtonDown());
	}
	
	return(0);
}

/*****************************************************************************
 * 函数名称：按键状态获取函数
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sButtonPressCheck(void)
{
	INT8U i;
	
	for(i = 0;i < 4;i++)
	{
		if(Button.all & (1 << i))										//当前状态为按住
		{
			if(++lubButtonOnCnt[i]>=200)
			{
				lubButtonOnCnt[i] = 200;
			}
			if(sGetButtonState(i))										//判断按键当前是否被按下
			{
				cLCMAOn();
				luwNoOprateCnt = 0;
				lubButtonOffCnt[i] = 0;
				if(lubButtonOnCnt[i] >= cLongPressLimit)				//长按确认
					{
						Button.all &= ~(1 << (i + 4));
						Button.all |= (1 << (i + 8));
					}
			}
			else
			{
				Button.all &= ~(1 << (i + 8));
				if(++lubButtonOffCnt[i] >= cButtonOffMax)
				{							
					if(lubButtonOnCnt[i] >= cShortPressLimit)			//短按确认
					{
						Button.all |= (1 << (i + 4));	
						Button.all &= ~(1 << (i + 8));
						cSpeakerOn();
						lubSpeakerflag = 1;
					}
					else
					{
						Button.all &= ~(1 << (i + 4));
						Button.all &= ~(1 << (i + 8));
					}				
					lubButtonOnCnt[i] = 0;
					Button.all &= ~(1 << i);							//设为释放状态
				}
			}
		}
		else															//当前状态为释放
		{
			if(sGetButtonState(i))	
			{
				if(++lubButtonOnCnt[i] >= cButtonOnMax)
				{
					cLCMAOn();
					luwNoOprateCnt = 0;
					lubButtonOnCnt[i] = 0;
					Button.all |= (1 << i);						
				}
			}
			else
			{
				lubButtonOnCnt[i] = 0;				
			}
		}
	}
	
	if(lubSpeakerflag == 1)
	{
		if(++lubSpeakerOnCnt >= cSpeakerOnLimit)
		{
			lubSpeakerOnCnt = 0;
			cSpeakerOff();
			lubSpeakerflag = 0;
		}
	}

	if(Button.bit.ubUpLongPress && Button.bit.ubDownLongPress && Button.bit.ubEnterLongPress)
	{
		if(++lubResetCnt <= 10)
		{
			cSpeakerOn();
			Info.data.ubFirstTurnOn = cTrue;	
			sClearRamByte(gubBlockPtr[cEnergyBlock],cMaxLength[cEnergyBlock]);
			sClearRamByte(gubBlockPtr[cErrorRecordBlock],cMaxLength[cErrorRecordBlock]);
			IicFlag.all |= 0x1C00;
		}
		else
		{
			cSpeakerOff();
		}	
	}
	else
	{
		lubResetCnt = 0;
	}
}




/*****************************************************************************
 * 函数名称：显示任务
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sDisplayTask(void)
{
	sButtonPressCheck();															//按键控制
	if(++lubRefreshCnt >= cRefreshTime)
	{
		lubRefreshCnt = 0;
		sChooseInterface();															//设定显示界面
		sUpdateLCD();																//更新LCD显示
		Button.all &= 0xF0F;														//短按响应结束
	}
}



/*****************************************************************************
 * 函数名称：延时函数
 * 函数输入：循环次数
 * 函数返回值：无
 * 函数描述：无
 ****************************************************************************/
void sDelay(INT16U i)
{
	while(i)
	{
		i--;
	}
}

/*****************************************************************************
 * 函数名称：LCD空闲判断函数
 * 函数输入：无
 * 函数返回值：LCD忙标志位
 * 函数描述：返回1表示LCD忙，返回0表示LCD空闲
 ****************************************************************************/
INT8U sGetLCDState(void)
{
	INT8U lubBusyFlag;
	
	cLCMRSOff();
	cLCMRWOn();
	sDelay(3);
	LCDOUT(0xff);
	GPIOC->MODER = 0x00000000;													//设为输入
	cLCMENOn();
	sDelay(3);
	lubBusyFlag = GPIO_ReadInputData(GPIOC);									//读取状态
	GPIOC->MODER = 0x55550000;													//设为输出
	cLCMENOff();
	sDelay(3);
	return(lubBusyFlag & 0x8000);
}

/*****************************************************************************
 * 函数名称：写LCD数据函数
 * 函数输入：数据，指令
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sWriteLCDData(INT8U lubData,INT8U lubCmd)
{
	if(lubCmd)
	{
		cLCMRSOn();
	}
	else
	{
		cLCMRSOff();
	}
	cLCMRWOff();
	sDelay(70);
	cLCMENOn();
	sDelay(90);
	LCDOUT(lubData);
	sDelay(90);
	cLCMENOff();
	sDelay(70);
}

/*****************************************************************************
 * 函数名称：显示初始化函数
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sInitDisplayTask(void)
{
	INT8U i,j;
	
	/***************初始化显示缓存***************/
	for(i = 0;i < 4;i++)
	{
		for(j = 0;j < 20;j++)
		{
			lubScreenBuf[i][j] = 0x20;
		}
	}
	
	/***************初始化显示界面***************/
	sWriteLCDData(0x38,0);
	sDelay(0x0F);
	sWriteLCDData(0x38,0);
	sDelay(0x0F);
	sWriteLCDData(0x38,0);
	sDelay(0x0F);
	for(i = 0;i < 4;i++)
	{
		while(sGetLCDState())
		{
			if(++luwBusyCheckCnt >= 9000)
			break;
		}
		luwBusyCheckCnt = 0;
		sWriteLCDData(lubLCMINTable[i],0);
	}
	lubInterface = cDefaultInterface;

	if(Safty.data.Protection.bit.ub60Hz)
	{
		luwFreqSetMin[0] = 6010;
		luwFreqSetMin[1] = 6010;
		luwFreqSetMin[4] = 5500;
		luwFreqSetMin[5] = 5500;
		luwFreqSetMax[0] = 6500;
		luwFreqSetMax[1] = 6500;
		luwFreqSetMax[4] = 5990;
		luwFreqSetMax[5] = 5990;
	}
	else
	{
		luwFreqSetMin[0] = 5010;
		luwFreqSetMin[1] = 5010;
		luwFreqSetMin[4] = 4500;
		luwFreqSetMin[5] = 4500;
		luwFreqSetMax[0] = 5500;
		luwFreqSetMax[1] = 5500;
		luwFreqSetMax[4] = 4990;
		luwFreqSetMax[5] = 4990;
	}
	
