Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
	luwFreqSetMin[2] = 100;
	luwFreqSetMin[3] = 100;
	luwFreqSetMin[6] = 100;
	luwFreqSetMin[7] = 100;
	luwFreqSetMax[2] = 65000;
	luwFreqSetMax[3] = 60000;
	luwFreqSetMax[6] = 65000;
	luwFreqSetMax[7] = 60000;
	
}


/*****************************************************************************
 * 函数名称：显示缓存设置函数
 * 函数输入：行数，列数，长度，待设置数据
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sWriteScreenBuf(INT8U lubLine,INT8U lubRow,INT8U lubLength,INT8U *lubDataAdr)
{
	INT8U i;	
	if(lubLine < cMaxLine)
	{
		for(i = lubRow;(i < cMaxRow) && (i < lubRow + lubLength) && (*lubDataAdr != '\0');i++)
		{
			lubScreenBuf[lubLine][i] = *lubDataAdr;
			lubDataAdr++;
		}
	}
}

/*****************************************************************************
 * 函数名称：界面选择函数
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sChooseInterface(void)
{
	INT8U i;
	INT16U luwKeyDataSetTemp;
	INT16U luwPVDCTemp;
	INT16U luwParamSetTemp;
	INT16U luwAutoTestTemp1;
	INT16U luwAutoTestTemp2;
	INT32U lulError,Error_Temp;
		
	if((Button.all & 0x0FF0) == 0)						//10s无操作则返回默认界面
	{
		if(++luwNoOprateCnt >= 600)
		{
			cLCMAOff();
			luwNoOprateCnt = 600;
			lubInterface = cDefaultInterface;
			lubIconSelected = 0;
		}
	}
	else
	{
		luwNoOprateCnt = 0;
	}
	

 if(lubInterface == cDefaultInterface)										//默认首界面
	{
		if(INV_StateFlag == 4)
		{
			strcpy(lubString,"Normal   ");
		}
		else
		{
			if(INV_StateFlag == 8)
			{
				strcpy(lubString,"Fault    ");
			}
			else
			{
				if(INV_StateFlag == 3)
				{
					strcpy(lubString,"Wait   s ");
					sTransferData(0,MasterData.data.uwReconnectTime,&lubString[4],3);	
					sDisplayAsist(4,6,lubString);
				}
				else
				{
					strcpy(lubString,"Waiting  ");
				}
			}
		
		}
		sWriteScreenBuf(0,0,9,lubString);	
		sWriteScreenBuf(0,9,11,(INT8U *)lubSafty[Safty.data.uwCountry]);
		
		strcpy(lubString,(INT8U *)lubPowerDisplay[Info.data.ublanguage]);
		strcpy(&lubString[8],"           W");
		sTransferData(0,__REV(Grid_Info.outActivePower),&lubString[10],8);
		sDisplayAsist(10,17,lubString);
		sWriteScreenBuf(1,0,20,lubString);	
		
		strcpy(lubString,(INT8U *)lubETodayDisplay[Info.data.ublanguage]);
		strcpy(&lubString[8],"         kWh");
		sTransferData(1,Grid_Info.sDailyElecGeneration,&lubString[12],4);
		if(Grid_Info.sDailyElecGeneration <  10)
		{
			sDisplayAsist(12,14,lubString);
		}
		else
		{
			sDisplayAsist(12,15,lubString);
		}
	
		sWriteScreenBuf(2,0,20,lubString);
		if(lubIconSelected >= 4)
		{
			lubIconSelected = 0;
		}
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			sWriteScreenBuf(3,0,20,(INT8U *)lubDefaultInterfaceIcon[Info.data.ublanguage][0]);	
		}
		else if(lubBlinkCnt >= 10)
		{
			sWriteScreenBuf(3,0,20,(INT8U *)lubDefaultInterfaceIcon[Info.data.ublanguage][lubIconSelected]);
		}
		
		if(Button.bit.ubEnterPress)													//单击Enter键
		{       
			lubInterface = (lubIconSelected + 1) << 8;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress)												//单击Up键
		{       
			if(++lubIconSelected >= 4)
			{
				lubIconSelected = 0;
			}
			lubBlinkCnt = 9;
		}
		else if(Button.bit.ubDownPress)												//单击Down键
		{
			if(--lubIconSelected >= 4)
			{
				lubIconSelected = 3;
			}
			lubBlinkCnt = 9;
		}
		else if(Button.bit.ubEscPress)												//单击Esc键
		{
			lubInterface = cDefaultInterface;
			lubIconSelected = 0;
		}
		lubFreqOrPfFlg = 0;
	}

	else if(lubInterface == cETotalInterface)										//总发电量界面
	{
		strcpy(lubString,"        . kWh");
		sTransferData(1,__REV(Grid_Info.ulTotalElecGeneration),&lubString[1],8);					
		sDisplayAsist(1,7,lubString);
		sWriteScreenBuf(0,0,7,(INT8U *)lubETotalDisplay[Info.data.ublanguage]);
		sWriteScreenBuf(0,7,13,lubString);
		strcpy(lubString,"PV Input Mode:      ");
		sWriteScreenBuf(1,0,20,lubString);
		strcpy(lubString,"                    ");
		sWriteScreenBuf(2,0,20,lubString);
		if(Pv_Info.usPvInputConnectionMode == 0x01)
		{
			strcpy(lubString,"         Single MPPT");
			sWriteScreenBuf(2,0,20,lubString);
		}
		if(Pv_Info.usPvInputConnectionMode == 0x02)
		{
			strcpy(lubString,"      Multiple MPPTs");
			sWriteScreenBuf(2,0,20,lubString);
		}	
		strcpy(lubString,"                    ");
		sWriteScreenBuf(3,0,20,lubString);
		
		if(Button.bit.ubEnterPress)													//单击Enter键
		{       
			lubInterface = cDCInterface;
		}
		else if(Button.bit.ubEscPress)												//单击Esc键
		{       
			lubInterface = cDefaultInterface;
		}
	}
	else if(lubInterface == cDCInterface)											//PV显示界面
	{
		sWriteScreenBuf(0,0,20,"DC:                 ");
		sWriteScreenBuf(1,0,20,"   PV1      PV2     ");
		strcpy(lubString,"V:    . V      . V  ");
		if(PRJ_NUMBER == HORNET)
		{
			if((Pv_Info.astrPvArrayDisplayInfo[0].PV_INPUT_VOL&0x8000) == 0)
				{
					sTransferData(1,Pv_Info.astrPvArrayDisplayInfo[0].PV_INPUT_VOL,&lubString[3],4);
				}
				else
				{
					strcpy(&lubString[2],"-");
					luwPVDCTemp = 65536-Pv_Info.astrPvArrayDisplayInfo[0].PV_INPUT_VOL;
					sTransferData(1,luwPVDCTemp,&lubString[3],4);
				}
				if((Pv_Info.astrPvArrayDisplayInfo[1].PV_INPUT_VOL&0x8000) == 0)
				{
					sTransferData(1,Pv_Info.astrPvArrayDisplayInfo[1].PV_INPUT_VOL,&lubString[12],4);
				}
				else
				{
					strcpy(&lubString[11],"-");
					luwPVDCTemp = 65536-Pv_Info.astrPvArrayDisplayInfo[1].PV_INPUT_VOL;
					sTransferData(1,luwPVDCTemp,&lubString[12],4);
				}
		}
		else if(PRJ_NUMBER == SUNNYBEE)
		{
			sTransferData(1,Pv_Info.astrPvArrayDisplayInfo[0].PV_INPUT_VOL,&lubString[3],4);
			sTransferData(1,Pv_Info.astrPvArrayDisplayInfo[1].PV_INPUT_VOL,&lubString[12],4);
		}
		sDisplayAsist(3,5,lubString);
		sDisplayAsist(12,14,lubString);
		sWriteScreenBuf(2,0,20,lubString);
		
		strcpy(lubString,"I:    . A      . A  ");
		if(PRJ_NUMBER == HORNET)
		{
			if((Pv_Info.astrPvArrayDisplayInfo[0].PV_INPUT_CUR&0x8000) == 0)
				{
					sTransferData(1,Pv_Info.astrPvArrayDisplayInfo[0].PV_INPUT_CUR,&lubString[3],4);
				}
				else
				{
					strcpy(&lubString[2],"-");
					luwPVDCTemp = 65536-Pv_Info.astrPvArrayDisplayInfo[0].PV_INPUT_CUR;
					sTransferData(1,luwPVDCTemp,&lubString[3],4);
				}
			if((Pv_Info.astrPvArrayDisplayInfo[1].PV_INPUT_CUR&0x8000) == 0)
				{
					sTransferData(1,Pv_Info.astrPvArrayDisplayInfo[1].PV_INPUT_CUR,&lubString[12],4);
				}
				else
				{
					strcpy(&lubString[11],"-");
					luwPVDCTemp = 65536-Pv_Info.astrPvArrayDisplayInfo[1].PV_INPUT_CUR;
					sTransferData(1,luwPVDCTemp,&lubString[12],4);
				}
		}
		else if(PRJ_NUMBER == SUNNYBEE)
		{
			sTransferData(1,Pv_Info.astrPvArrayDisplayInfo[0].PV_INPUT_CUR,&lubString[3],4);
			sTransferData(1,Pv_Info.astrPvArrayDisplayInfo[1].PV_INPUT_CUR,&lubString[12],4);
		}
		sDisplayAsist(3,5,lubString);												//显示优化
		sDisplayAsist(12,14,lubString);
		sWriteScreenBuf(3,0,20,lubString);
		
		
