Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
		if(Button.bit.ubEnterPress)													//单击Enter键
		{        
			lubInterface = cACInterface;
		}
		else if(Button.bit.ubEscPress)												//单击Esc键
		{       
			lubInterface = cDefaultInterface;
		}
	}
	else if(lubInterface == cACInterface)											//AC显示界面
	{
		if(lubFreqOrPfFlg == 1)
		{
			if(INV_StateFlag == 4)
			{
				lubPowerFactor = Grid_Info.sPowerFactor;			
			}
			else
			{
				lubPowerFactor = 0;
			}
		
			strcpy(lubString,"AC:        PF:  .   ");		
			sTransferData(3,(INT16U)lubPowerFactor,&lubString[15],4);			
		}
		else
		{			
			strcpy(lubString,"AC:        F:  .  Hz");
			sTransferData(2,Grid_Info.ausGridFreq,&lubString[13],4);
			sDisplayAsist(13,14,lubString);
		}
		
		sWriteScreenBuf(0,0,20,lubString);
		 
		strcpy(lubString,"VR:   . V  IR:   . A");
		sTransferData(1,Grid_Info.ausGridPhaseVolt[cPhaseR],&lubString[3],4);
		sDisplayAsist(3,5,lubString);
		sTransferData(1,Grid_Info.ausGridPhaseCur[cPhaseR],&lubString[14],4);
		sDisplayAsist(14,16,lubString);
		sWriteScreenBuf(1,0,20,lubString);
		
		sWriteScreenBuf(2,0,20,"                    ");
		sWriteScreenBuf(3,0,20,"                    ");
		if(PRJ_NUMBER == HORNET)
		{
			strcpy(lubString,"VS:   . V  IS:   . A");
			sTransferData(1,Grid_Info.ausGridPhaseVolt[cPhaseS],&lubString[3],4);
			sDisplayAsist(3,5,lubString);
			sTransferData(1,Grid_Info.ausGridPhaseCur[cPhaseS],&lubString[14],4);
			sDisplayAsist(14,16,lubString);
			sWriteScreenBuf(2,0,20,lubString);
			
			strcpy(lubString,"VT:   . V  IT:   . A");
			sTransferData(1,Grid_Info.ausGridPhaseVolt[cPhaseT],&lubString[3],4);
			sDisplayAsist(3,5,lubString);
			sTransferData(1,Grid_Info.ausGridPhaseCur[cPhaseT],&lubString[14],4);
			sDisplayAsist(14,16,lubString);
			sWriteScreenBuf(3,0,20,lubString);		
		}
		
		if(Button.bit.ubEnterPress)													//单击Enter键
		{    
			if(lubFreqOrPfFlg == 1)  
			{
				lubFreqOrPfFlg = 0;
				lubInterface = cTimeInterface;
			}
			else
			{
				lubFreqOrPfFlg = 1;
			}
		}
		else if(Button.bit.ubEscPress)												//单击Esc键
		{      
			lubFreqOrPfFlg = 0;
			lubInterface = cDefaultInterface;
		}

	}
	else if(lubInterface == cTimeInterface)											//时间显示界面
	{
		sWriteScreenBuf(0,0,20,"Date:               ");
		strcpy(lubString,"          20  -  -  ");
		lubString[12] = SystemTime.data.ubYear / 10 + 0x30;
		lubString[13] = (SystemTime.data.ubYear % 10) + 0x30;
		lubString[15] = SystemTime.data.ubMonth / 10 + 0x30;
		lubString[16] = (SystemTime.data.ubMonth % 10) + 0x30;
		lubString[18] = SystemTime.data.ubDate / 10 + 0x30;
		lubString[19] = (SystemTime.data.ubDate % 10) + 0x30;
		
		sWriteScreenBuf(1,0,20,lubString);
		strcpy(lubString,"Time:       :  :    ");
		lubString[10] = SystemTime.data.ubHour / 10 + 0x30;
		lubString[11] = (SystemTime.data.ubHour % 10) + 0x30;
		lubString[13] = SystemTime.data.ubMinute / 10 + 0x30;
		lubString[14] = (SystemTime.data.ubMinute % 10) + 0x30;
		lubString[16] = SystemTime.data.ubSecond / 10 + 0x30;
		lubString[17] = (SystemTime.data.ubSecond % 10) + 0x30;
		sWriteScreenBuf(2,0,20,lubString);
		sWriteScreenBuf(3,0,20,"                    ");
		
		if(Button.bit.ubEnterPress)						//单击Enter键
		{       
			lubInterface = cTempInterface;
		}
		else if(Button.bit.ubEscPress)
		{
			lubInterface = cDefaultInterface;
		}
	}
	else if(lubInterface == cTempInterface)     //温度显示界面
	{	
		sWriteScreenBuf(0,0,20,"Temperature:        ");
		strcpy(lubString,"Inside:   .         ");
		sTransferData(1,Grid_Info.sEvirTmp1,&lubString[7],4);
		lubString[12] = 0xB2;
		lubString[13] = 0x43;
		sDisplayAsist(7,9,lubString);
		sWriteScreenBuf(1,0,20,lubString);
		
		strcpy(lubString,"Heat sink:   .      ");
		sTransferData(1,Grid_Info.sHeatsinkTmp,&lubString[10],4);
		lubString[15] = 0xB2;
		lubString[16] = 0x43;
		sDisplayAsist(10,12,lubString);
		sWriteScreenBuf(2,0,20,lubString);
			
			
		if(Button.bit.ubEnterPress || Button.bit.ubEscPress)						//单击Enter或Esc键
		{       
			lubInterface = cDefaultInterface;
		}		
	}
	/*********************************************************************
	*
	*													info
	*
	*
	**********************************************************************/
	else if(lubInterface == cInfoSN)											
	{
		sWriteScreenBuf(0,0,20,"SN:                 ");
		sWriteScreenBuf(0,4,16,Info_t.data.ausProductSn);
		sWriteScreenBuf(1,0,20,"                    ");
		sWriteScreenBuf(1,4,16,(&Info_t.data.ausProductSn[16]));
		sWriteScreenBuf(2,0,20,"Model:              ");
		sWriteScreenBuf(2,6,14,Info_t.data.ausProductModel);
		sWriteScreenBuf(3,0,20,"                    ");
		
		if(Button.bit.ubEscPress)													//单击Esc键
		{        
			lubInterface = cDefaultInterface;
		}
		else if(Button.bit.ubUpPress)												//单击Up键
		{       
			lubInterface = cInfoLCDVersion;
		}
		else if(Button.bit.ubDownPress)												//单击Down键
		{        
			lubInterface = cInfoVersion;
		}
		else if(Button.bit.ubEnterLongPress && INV_StateFlag != 4)
		{
			SlaveData.data.SlaveFlag.bit.ubConstPV = 1;
			lubInterface = cDefaultInterface;
		}
	}

	else if(lubInterface == cInfoVersion)												
	{
		sWriteScreenBuf(0,0,20,"Software Version:   ");
		sWriteScreenBuf(1,0,20,"                    ");
		sWriteScreenBuf(1,4,16,Info_t.data.ausFirmwareVer);
		sWriteScreenBuf(2,0,20,"Protocol Version:   ");
		sWriteScreenBuf(3,0,20,"                    ");
		sWriteScreenBuf(3,4,16,Info_t.data.ausProtocolNum);
		sWriteScreenBuf(3,12,8,Info_t.data.ausProtocolVer);
	
		if(Button.bit.ubEscPress)													//单击Esc键
		{        
			lubInterface = cDefaultInterface;
		}
		else if(Button.bit.ubUpPress)												//单击Up键
		{       
			lubInterface = cInfoSN;
		}
		else if(Button.bit.ubDownPress)												//单击Down键
		{        
			lubInterface = cInfoLCDVersion;
		}
	}
		else if(lubInterface == cInfoLCDVersion)												
		{
		sWriteScreenBuf(0,0,20,"                    ");
		sWriteScreenBuf(1,0,20,"LCD Soft Version:   ");
		sWriteScreenBuf(2,0,20,"                    ");
		sWriteScreenBuf(2,13,20,version);
		sWriteScreenBuf(3,0,20,"                    ");

		if(Button.bit.ubEscPress)													//单击Esc键
		{        
			lubInterface = cDefaultInterface;
		}
		else if(Button.bit.ubUpPress)												//单击Up键
		{       
			lubInterface = cInfoVersion;
		}
		else if(Button.bit.ubDownPress)												//单击Down键
		{        
			lubInterface = cInfoSN;
		}
	}
	/*********************************************************************
	*
	*													故障记录界面
	*
	*
	**********************************************************************/	
	
	else if(lubInterface >= cErrorPage1 && lubInterface <= cErrorPage20)			
	{
		lulError = ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.ErrorCodeL;
		if(lulError)																//存在最新一条故障
		{
			strcpy(lubString,"Page      20  -  -  ");
			lubString[4] = (lubInterface - cErrorPage1 + 1) / 10 + 0x30;
			lubString[5] = ((lubInterface - cErrorPage1 + 1) % 10) + 0x30;
			
			if(ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Month == 0)
				ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Month  = 1;
			if(ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Date == 0)
				ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Date  = 1;
			
