Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
			lubString[12] = ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Year / 10 + 0x30;
			lubString[13] = (ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Year % 10) + 0x30;
			lubString[15] = ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Month / 10 + 0x30;
			lubString[16] = (ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Month % 10) + 0x30;
			lubString[18] = ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Date / 10 + 0x30;
			lubString[19] = (ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Date % 10) + 0x30;
			sWriteScreenBuf(0,0,20,lubString);
			strcpy(lubString,"E           :  :    ");
			Error_Temp = __REV16(lulError);
			if(PRJ_NUMBER == SUNNYBEE)
			{
				if((Error_Temp >= 0x0100)&&(Error_Temp <= 0x0106))
				{
					Error_Temp = Error_Temp&0x000F+1;
				}
				else
				{
					if((Error_Temp >= 0x0200)&&(Error_Temp <= 0x0208))
					{
						Error_Temp = (Error_Temp&0x000F)+8;
					}
					else
					{
						if((Error_Temp >= 0x0210)&&(Error_Temp <= 0x0218))
						{
							Error_Temp = (Error_Temp&0x000F)+16;
						}
						else
						{
							if((Error_Temp >= 0x0300)&&(Error_Temp <= 0x0307))
							{
								Error_Temp = (Error_Temp&0x000F)+23;
							}
							else
							{
								if((Error_Temp >= 0x0401)&&(Error_Temp <= 0x0409))
								{
									Error_Temp = (Error_Temp&0x000F)+30;
								}
								else
								{
									if((Error_Temp >= 0x0410)&&(Error_Temp <= 0x0416))
									{
										Error_Temp = (Error_Temp&0x000F)+40;
									}
									else
									{
										if((Error_Temp >= 0x0501)&&(Error_Temp <= 0x0509))
										{
											Error_Temp = (Error_Temp&0x000F)+46;
										}
										else
										{
											if((Error_Temp >= 0x0510)&&(Error_Temp <= 0x051A))
											{
												Error_Temp = (Error_Temp&0x000F)+56;
											}
											else
											{
												if((Error_Temp >= 0x0520)&&(Error_Temp <= 0x0529))
												{
													Error_Temp = (Error_Temp&0x000F)+67;
												}
												else
												{
													if(Error_Temp == 0x0530)
													{
														Error_Temp = (Error_Temp&0x000F)+77;
													}
												}
											}
										}
									}
								}
							}
						}
					}
				}		
			}
			else if(PRJ_NUMBER == HORNET)
			{
				if((Error_Temp >= 0x0100)&&(Error_Temp <= 0x0106))
				{
					Error_Temp = Error_Temp&0x000F+1;
				}
				else
				{
					if((Error_Temp >= 0x0200)&&(Error_Temp <= 0x0209))
					{
						Error_Temp = (Error_Temp&0x000F)+8;
					}
					else
					{
						if((Error_Temp >= 0x0210)&&(Error_Temp <= 0x0214))
						{
							Error_Temp = (Error_Temp&0x000F)+18;
						}
						else
						{
							if((Error_Temp >= 0x0300)&&(Error_Temp <= 0x0307))
							{
								Error_Temp = (Error_Temp&0x000F)+23;
							}
							else
							{
								if((Error_Temp >= 0x0401)&&(Error_Temp <= 0x0409))
								{
									Error_Temp = (Error_Temp&0x000F)+30;
								}
								else
								{
									if((Error_Temp >= 0x0410)&&(Error_Temp <= 0x0416))
									{
										Error_Temp = (Error_Temp&0x000F)+40;
									}
									else
									{
										if((Error_Temp >= 0x0501)&&(Error_Temp <= 0x0509))
										{
											Error_Temp = (Error_Temp&0x000F)+46;
										}
										else
										{
											if((Error_Temp >= 0x0510)&&(Error_Temp <= 0x0519))
											{
												Error_Temp = (Error_Temp&0x000F)+56;
											}
											else
											{
												if((Error_Temp >= 0x0520)&&(Error_Temp <= 0x0527))
												{
													Error_Temp = (Error_Temp&0x000F)+66;
												}
												else
												{
													if((Error_Temp >= 0x0601)&&(Error_Temp <= 0x0606))
													{
														Error_Temp = (Error_Temp&0x000F)+73;
													}
												}
											}
										}
									}
								}
							}
						}
					}
				}		
			}
			lubString[1] = Error_Temp / 10 + 0x30;
			lubString[2] = Error_Temp % 10 + 0x30;			
			lubString[10] = ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Hour / 10 + 0x30;
			lubString[11] = (ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Hour % 10) + 0x30;
			lubString[13] = ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Minute / 10 + 0x30;
			lubString[14] = (ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Minute % 10) + 0x30;
			lubString[16] = ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Second / 10 + 0x30;
			lubString[17] = (ErrorRecord.data.ErrorMessage[lubInterface - cErrorPage1].data.Second % 10) + 0x30;
			sWriteScreenBuf(1,0,20,lubString);
			if(PRJ_NUMBER == HORNET)
				sWriteScreenBuf(2,0,20,(INT8U *)MF_lubErrorInterpret[Error_Temp]);
			else if(PRJ_NUMBER == SUNNYBEE)
				sWriteScreenBuf(2,0,20,(INT8U *)HF_lubErrorInterpret[Error_Temp]);
			sWriteScreenBuf(3,0,20,"                    ");
			
			if(Button.bit.ubEscPress)												//单击Esc键
			{       
				lubInterface = cDefaultInterface;
			}
			else if(Button.bit.ubUpPress)											//单击Up键
			{       
				if(--lubInterface < cErrorPage1)
				{
					lubInterface = cErrorPage20;
				}
			}
			else if(Button.bit.ubDownPress)											//单击Down键
			{        
				if(++lubInterface > cErrorPage20)
				{
					lubInterface = cErrorPage1;
				}
			}
		}
		else                                      //无故障
		{
			if(lubInterface == cErrorPage1)
			{	
				sWriteScreenBuf(0,0,20,"                    ");
				sWriteScreenBuf(1,0,20,"  No Error Record   ");
				sWriteScreenBuf(2,0,20,"                    ");
				sWriteScreenBuf(3,0,20,"                    ");
						
				if(Button.bit.ubEscPress)												//??Esc?
				{       
					lubInterface = cDefaultInterface;
				}
			}
			else
			{
				lubInterface = cErrorPage1;				
			}
		}
	}
/*********************************************************************
	*
	*													设置界面
	*
	*
	**********************************************************************/	
	else if(lubInterface == cSetInterface)
	{
		sWriteScreenBuf(0,0,8,(INT8U *)lubSetMenuDisplay[Info.data.ublanguage]);
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			sWriteScreenBuf(0,8,12,(INT8U *)lubSetListDisplay[Info.data.ublanguage][lubIconSelected]);
		}
		else if(lubBlinkCnt >= 10)
		{
			sWriteScreenBuf(0,8,12,"            ");
		}
		sWriteScreenBuf(1,0,8,"        ");
		sWriteScreenBuf(2,0,8,"        ");
		sWriteScreenBuf(3,0,8,"        ");
		lubMaxSetListTemp = cMaxSetList;
		sWriteScreenBuf(1,8,12,(INT8U *)lubSetListDisplay[Info.data.ublanguage][(lubIconSelected + 1) % lubMaxSetListTemp]);
		sWriteScreenBuf(2,8,12,(INT8U *)lubSetListDisplay[Info.data.ublanguage][(lubIconSelected + 2) % lubMaxSetListTemp]);
		sWriteScreenBuf(3,8,12,(INT8U *)lubSetListDisplay[Info.data.ublanguage][(lubIconSelected + 3) % lubMaxSetListTemp]);
		
		if(Button.bit.ubEscPress)												//单击Esc键
		{        
			lubInterface = cDefaultInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress)											//单击Up键
		{      
			lubBlinkCnt = 10;  			
			if(--lubIconSelected >= lubMaxSetListTemp )
			{
				lubIconSelected = lubMaxSetListTemp - 1;
			}
		}
		else if(Button.bit.ubDownPress)											//单击Down键
		{        
			lubBlinkCnt = 10;  
			if(++lubIconSelected >= lubMaxSetListTemp)
			{
				lubIconSelected = 0;
			}	
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{   
			if((lubIconSelected > 1)&&(lubIconSelected <=12)) 
			{
				lubInterfacePre = lubInterface + lubIconSelected + 1;
				lubInterface = cPasswordIn;
			}
			else
			{
				lubInterfacePre = cSetInterface;
				lubInterface += lubIconSelected + 1;
			}
			
			lubIconSelected = 0;				
			TimeSet = SystemTime;
			if(PRJ_NUMBER == SUNNYBEE)
			{
				luwParamSet[0] = __REV16(*Param_Set_Info.MActPwrSetValue);     //通用设置
				luwParamSet[1] = __REV16(*Param_Set_Info.MReactPwrModeEn);
				luwParamSet[2] = __REV16(*Param_Set_Info.MPowerFactorSetVal);
				luwParamSet[3] = __REV16(*Param_Set_Info.MReactPwrSetValue);
				luwParamSet[4] = __REV16(*Param_Set_Info.MItalyOutsideCommFlag);
			}
			else if(PRJ_NUMBER == HORNET)
			{
				luwParamSet[0] = __REV16(*Param_Set_Info.HMaxOutputPwrPercent);     //通用设置
				luwParamSet[1] = __REV16(*Param_Set_Info.HReactPwrModeEn);
				luwParamSet[2] = __REV16(*Param_Set_Info.HPowerFactorSetVal);
				luwParamSet[3] = __REV16(*Param_Set_Info.HReactPwrQPercent);	
			}
			
			luwProtectionSet[0] = __REV16(*Protection_Func_Enable_Info.ActiveAntiIslandingEn);    //保护使能
			luwProtectionSet[1] = __REV16(*Protection_Func_Enable_Info.GfciEn);
			luwProtectionSet[2] = __REV16(*Protection_Func_Enable_Info.IsoCheckEn);
			luwProtectionSet[3] = __REV16(*Protection_Func_Enable_Info.DcInjectionEn);
			luwProtectionSet[4] = __REV16(*Protection_Func_Enable_Info.GridVoltProtThresAutoAdjEn);
			luwProtectionSet[5] = __REV16(*Protection_Func_Enable_Info.GridVoltHighPwrDeratedEn);
			luwProtectionSet[6] = __REV16(*Protection_Func_Enable_Info.GlobalMpptScanEn);
			luwProtectionSet[7] = __REV16(*Protection_Func_Enable_Info.PvVICurveEn);
			luwProtectionSet[8] = __REV16(*Protection_Func_Enable_Info.ItalySelfTestEN);
			luwProtectionSet[9] = __REV16(*Protection_Func_Enable_Info.PidFuncEn);
			luwProtectionSet[10] = __REV16(*Protection_Func_Enable_Info.DrmFuncEn);
			luwProtectionSet[11] = __REV16(*Protection_Func_Enable_Info.ArcDetectEn);
			luwProtectionSet[12] = __REV16(*Protection_Func_Enable_Info.ArcResetEn);
			if(PRJ_NUMBER == SUNNYBEE)
			{
				luwProtectionSet[13] = __REV16(*Protection_Func_Enable_Info.ZeroExpPercent);
			}
			else if(PRJ_NUMBER == HORNET)
			{
				luwProtectionSet[13] = __REV16(*Protection_Func_Enable_Info.ReconnectPwrRampUpEn);
				luwProtectionSet[14] = __REV16(*Protection_Func_Enable_Info.AntiRefluxPwrPercent);
			}
			luwCurveSet[0] = __REV16(*Curve_Enable_Info.WattFreqModeEn); //曲线使能
			luwCurveSet[1] = __REV16(*Curve_Enable_Info.WattVoltModeEn);
			luwCurveSet[2] = __REV16(*Curve_Enable_Info.PfWattModeEn);
			luwCurveSet[3] = __REV16(*Curve_Enable_Info.VarVoltModeEn);
			luwCurveSet[4] = __REV16(*Curve_Enable_Info.VarWattModeEn);
			luwCurveSet[5] = __REV16(*Curve_Enable_Info.ResvModeEn);
			luwCurveSet[6] = __REV16(*Curve_Enable_Info.LVRTCurveEn);
			luwCurveSet[7] = __REV16(*Curve_Enable_Info.HVRTCurveEn);
			luwCurveSet[8] = __REV16(*Curve_Enable_Info.LFRTCurveEn);
			luwCurveSet[9] = __REV16(*Curve_Enable_Info.HFRTCurveEn);
			
			luwKeyDataSet[0] = 0x55;   //关键数据设置
			luwKeyDataSet[1] = 0x55;
			luwKeyDataSet[2] = __REV16(*Key_Data_Info.PvInputConnectionMode);
			luwKeyDataSet[3] = __REV16(*Key_Data_Info.TotalElecGenCompVal);
			
			luwInvSet[0] = __REV16(*INV_Set_Info.InvOnOffCmd);  //逆变器设置
			luwInvSet[1] = __REV16(*INV_Set_Info.WaitStandupTime);

			
			luwFreqSet[0] = __REV16(Safty.data.uwFreqHigh[0]);
			luwFreqSet[1] = __REV16(Safty.data.uwFreqHigh[1]);			
			luwFreqSet[2] = __REV16(Safty.data.uwFreqHighCnt[0]);				
			luwFreqSet[3] = __REV16(Safty.data.uwFreqHighCnt[1]);	
			luwFreqSet[4] = __REV16(Safty.data.uwFreqLow[0]);
			luwFreqSet[5] = __REV16(Safty.data.uwFreqLow[1]);			
			luwFreqSet[6] = __REV16(Safty.data.uwFreqLowCnt[0]);
			luwFreqSet[7] = __REV16(Safty.data.uwFreqLowCnt[1]);
			
			luwVoltSet[0] = __REV16(Safty.data.uwGridVoltHigh[0]);
			luwVoltSet[1] = __REV16(Safty.data.uwGridVoltHigh[1]);
			luwVoltSet[2] = __REV16(Safty.data.uwGridVoltHighCnt[0]);
			luwVoltSet[3] = __REV16(Safty.data.uwGridVoltHighCnt[1]);
			luwVoltSet[4] = __REV16(Safty.data.uwGridVoltLow[0]);
			luwVoltSet[5] = __REV16(Safty.data.uwGridVoltLow[1]);
			luwVoltSet[6] = __REV16(Safty.data.uwGridVoltLowCnt[0]);
			luwVoltSet[7] = __REV16(Safty.data.uwGridVoltLowCnt[1]);
			
