Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
			if(PRJ_NUMBER == SUNNYBEE)
			{
				luwProtectionSetMax[0] = 0xAA;
				luwProtectionSetMax[1] = 0xAA;
				luwProtectionSetMax[2] = 0xAA;
				luwProtectionSetMax[3] = 0xAA;
				luwProtectionSetMax[4] = 0xAA;
				luwProtectionSetMax[5] = 0xAA;
				luwProtectionSetMax[6] = 0xAA;
				luwProtectionSetMax[7] = 0xAA;
				luwProtectionSetMax[8] = 0xAA;
				luwProtectionSetMax[9] = 0xAA;
				luwProtectionSetMax[10] = 0xAA;
				luwProtectionSetMax[11] = 0xAA;
				luwProtectionSetMax[12] = 0xAA;
				luwProtectionSetMax[13] = 1000;
				luwProtectionSetMin[0] = 0x55;
				luwProtectionSetMin[1] = 0x55;
				luwProtectionSetMin[2] = 0x55;
				luwProtectionSetMin[3] = 0x55;
				luwProtectionSetMin[4] = 0x55;
				luwProtectionSetMin[5] = 0x55;
				luwProtectionSetMin[6] = 0x55;
				luwProtectionSetMin[7] = 0x55;
				luwProtectionSetMin[8] = 0x55;
				luwProtectionSetMin[9] = 0x55;
				luwProtectionSetMin[10] = 0x55;
				luwProtectionSetMin[11] = 0x55;
				luwProtectionSetMin[12] = 0x55;
				luwProtectionSetMin[13] = 1;
			}
			else if(PRJ_NUMBER == HORNET)
			{
				luwProtectionSetMax[0] = 1;
				luwProtectionSetMax[1] = 1;
				luwProtectionSetMax[2] = 1;
				luwProtectionSetMax[3] = 1;
				luwProtectionSetMax[4] = 1;
				luwProtectionSetMax[5] = 1;
				luwProtectionSetMax[6] = 1;
				luwProtectionSetMax[7] = 1;
				luwProtectionSetMax[8] = 1;
				luwProtectionSetMax[9] = 1;
				luwProtectionSetMax[10] = 1;
				luwProtectionSetMax[11] = 1;
				luwProtectionSetMax[12] = 1;
				luwProtectionSetMax[13] = 1;
				luwProtectionSetMax[14] = 100;
				luwProtectionSetMin[0] = 0;
				luwProtectionSetMin[1] = 0;
				luwProtectionSetMin[2] = 0;
				luwProtectionSetMin[3] = 0;
				luwProtectionSetMin[4] = 0;
				luwProtectionSetMin[5] = 0;
				luwProtectionSetMin[6] = 0;
				luwProtectionSetMin[7] = 0;
				luwProtectionSetMin[8] = 0;
				luwProtectionSetMin[9] = 0;
				luwProtectionSetMin[10] = 0;
				luwProtectionSetMin[11] = 0;
				luwProtectionSetMin[12] = 0;
				luwProtectionSetMin[13] = 0;
				luwProtectionSetMin[14] = 0;		
			}
			if(PRJ_NUMBER == SUNNYBEE)
			{
				luwParamSetMax[0] = 1100;
				luwParamSetMax[1] = 0xA4;
				luwParamSetMax[2] = 1000;
				luwParamSetMax[3] = 1000;
				luwParamSetMax[4] = 0xAA;
				luwParamSetMin[0] = 0;
				luwParamSetMin[1] = 0x55;
				luwParamSetMin[2] = -1000;
				luwParamSetMin[3] = -1000;
				luwParamSetMin[4] = 0x55;
			}
			else if(PRJ_NUMBER == HORNET)
			{
				luwParamSetMax[0] = 1100;
				luwParamSetMax[1] = 1;
				luwParamSetMax[2] = 1000;
				luwParamSetMax[3] = 1000;
				luwParamSetMin[0] = 0;
				luwParamSetMin[1] = 0;
				luwParamSetMin[2] = -1000;
				luwParamSetMin[3] = -1000;
			}
			
			if(PRJ_NUMBER == SUNNYBEE)
			{
				luwCurveSetMax[0] = 0xAA;
				luwCurveSetMax[1] = 0xAA;
				luwCurveSetMax[2] = 0xAA;
				luwCurveSetMax[3] = 0xAA;
				luwCurveSetMax[4] = 0xAA;
				luwCurveSetMax[5] = 0xAA;
				luwCurveSetMax[6] = 0xAA;
				luwCurveSetMax[7] = 0xAA;
				luwCurveSetMax[8] = 0xAA;
				luwCurveSetMax[9] = 0xAA;
				luwCurveSetMin[0] = 0x55;
				luwCurveSetMin[1] = 0x55;
				luwCurveSetMin[2] = 0x55;
				luwCurveSetMin[3] = 0x55;
				luwCurveSetMin[4] = 0x55;
				luwCurveSetMin[5] = 0x55;
				luwCurveSetMin[6] = 0x55;
				luwCurveSetMin[7] = 0x55;
				luwCurveSetMin[8] = 0x55;
				luwCurveSetMin[9] = 0x55;
			}
			else if(PRJ_NUMBER == HORNET)
			{
				luwCurveSetMax[0] = 1;
				luwCurveSetMax[1] = 1;
				luwCurveSetMax[2] = 1;
				luwCurveSetMax[3] = 1;
				luwCurveSetMax[4] = 1;
				luwCurveSetMax[5] = 1;
				luwCurveSetMax[6] = 1;
				luwCurveSetMax[7] = 1;
				luwCurveSetMax[8] = 1;
				luwCurveSetMax[9] = 1;
				luwCurveSetMin[0] = 0;
				luwCurveSetMin[1] = 0;
				luwCurveSetMin[2] = 0;
				luwCurveSetMin[3] = 0;
				luwCurveSetMin[4] = 0;
				luwCurveSetMin[5] = 0;
				luwCurveSetMin[6] = 0;
				luwCurveSetMin[7] = 0;
				luwCurveSetMin[8] = 0;
				luwCurveSetMin[9] = 0;
			}
			
				luwKeyDataSetMax[0] = 0xAA;
				luwKeyDataSetMax[1] = 0xAA;
				luwKeyDataSetMax[2] = 0x02;
				luwKeyDataSetMax[3] = 10000;
				luwKeyDataSetMin[0] = 0x55;
				luwKeyDataSetMin[1] = 0x55;
				luwKeyDataSetMin[2] = 0x01;
				luwKeyDataSetMin[3] = -10000;
			
				luwInvSetMax[0] = 0xAF;
				luwInvSetMax[1] = 255;
				luwInvSetMin[0] = 0xAE;
				luwInvSetMin[1] = 0;



		}
		
	}
	else if(lubInterface == cTimeSet)
	{
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
		}		
		sWriteScreenBuf(0,0,20,"Set Time:           ");
		strcpy(lubString,"          20  -  -  ");
		if(lubIconSelected != 0 || lubBlinkCnt < 10)
		{
			lubString[12] = TimeSet.data.ubYear / 10 + 0x30;
			lubString[13] = (TimeSet.data.ubYear % 10) + 0x30;
		}
		if(lubIconSelected != 1 || lubBlinkCnt < 10)
		{
			lubString[15] = TimeSet.data.ubMonth / 10 + 0x30;
			lubString[16] = (TimeSet.data.ubMonth % 10) + 0x30;
		}
		if(lubIconSelected != 2 || lubBlinkCnt < 10)
		{
			lubString[18] = TimeSet.data.ubDate / 10 + 0x30;
			lubString[19] = (TimeSet.data.ubDate % 10) + 0x30;
		}
		sWriteScreenBuf(1,0,20,lubString);
		
		strcpy(lubString,"            :  :    ");
		if(lubIconSelected != 3 || lubBlinkCnt < 10)
		{
			lubString[10] = TimeSet.data.ubHour / 10 + 0x30;
			lubString[11] = (TimeSet.data.ubHour % 10) + 0x30;
		}
		if(lubIconSelected != 4 || lubBlinkCnt < 10)
		{
			lubString[13] = TimeSet.data.ubMinute / 10 + 0x30;
			lubString[14] = (TimeSet.data.ubMinute % 10) + 0x30;
		}
		if(lubIconSelected != 5 || lubBlinkCnt < 10)
		{
			lubString[16] = TimeSet.data.ubSecond / 10 + 0x30;
			lubString[17] = (TimeSet.data.ubSecond % 10) + 0x30;
		}
		sWriteScreenBuf(2,0,20,lubString);
		sWriteScreenBuf(3,0,20,"                    ");
		
		if(Button.bit.ubEscPress)												//单击Esc键
		{        
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress || Button.bit.ubUpLongPress)				//单机或长按Up键
		{        
			if(lubIconSelected == 0)
			{
				if(++TimeSet.all[lubIconSelected] >= TimeRange.all[lubIconSelected])
				{
					TimeSet.all[lubIconSelected] = 17;							//年最小为17
				}
			}
			else if(lubIconSelected == 1 || lubIconSelected == 2)
			{
				if((TimeSet.all[1] == 4) || (TimeSet.all[1] == 6) || (TimeSet.all[1] == 9) || (TimeSet.all[1] == 11))
				{
					TimeRange.data.ubDate = 30;					
				}
				else
				{
					TimeRange.data.ubDate = 31;
				}
				if(TimeSet.all[1] == 2)
				{
					if(TimeSet.all[0] % 4 == 0)	
					{
						TimeRange.data.ubDate = 29;								//闰年
					}
					else
					{
						TimeRange.data.ubDate = 28;								//平年
					}
				}
				if(++TimeSet.all[lubIconSelected] > TimeRange.all[lubIconSelected])
				{
					TimeSet.all[lubIconSelected] = 1;							//月、日最小为1
				}	
			}
			else
			{
				if(++TimeSet.all[lubIconSelected] >= TimeRange.all[lubIconSelected])
				{
					TimeSet.all[lubIconSelected] = 0;							//时、分、秒最小为0
				}
			}
		}
		else if(Button.bit.ubDownPress || Button.bit.ubDownLongPress)			//单机或长按Down键
		{       
			if(lubIconSelected == 0)
			{
				if(--TimeSet.all[lubIconSelected] < 17)
				{
					TimeSet.all[lubIconSelected] = TimeRange.all[lubIconSelected] - 1;
				}
			}
			else if(lubIconSelected == 1 || lubIconSelected == 2)
			{
				if((--TimeSet.all[lubIconSelected] <= 0) || (TimeSet.all[lubIconSelected] > TimeRange.all[lubIconSelected]))
				{
					TimeSet.all[lubIconSelected] = TimeRange.all[lubIconSelected];
				}
			}
			else
			{
				if(--TimeSet.all[lubIconSelected] >= TimeRange.all[lubIconSelected])
				{
					TimeSet.all[lubIconSelected] = TimeRange.all[lubIconSelected] - 1;
				}
			}
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{        
			lubBlinkCnt = 10;
			if(++lubIconSelected >= 6)
			{
				lubInterface = cSetInterface;
				lubIconSelected = 0;
				SystemTime = TimeSet;			
				if(PRJ_NUMBER == SUNNYBEE)
				{
					memcpy(MF_ausSystemTime,SystemTime.all,6);
					write_10_date.usStartAddr = 0x2114;
					write_10_date.usLen = 3;
					FLAG_10_UPDATE = 1;
				}
				else if(PRJ_NUMBER == HORNET)
				{
					memcpy(HF_ausSystemTime,SystemTime.all,6);
					write_10_date.usStartAddr = 0x2280;
					write_10_date.usLen = 3;
					FLAG_10_UPDATE = 1;
				}
			}
		}
		
