Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
	}
	else if(lubInterface == cLanguageSet)										//语言设置界面
	{
		sWriteScreenBuf(0,0,20,"Language Select     ");
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			sWriteScreenBuf(1,0,20,(INT8U *)lubLanguage[lubIconSelected % 4]);
		}
		else if(lubBlinkCnt >= 10)
		{
			sWriteScreenBuf(1,0,20,"                    ");
		}
		sWriteScreenBuf(2,0,20,(INT8U *)lubLanguage[(1 + lubIconSelected) % 4]);
		sWriteScreenBuf(3,0,20,(INT8U *)lubLanguage[(2 + lubIconSelected) % 4]);
		
		if(Button.bit.ubEnterPress)													//单击Enter键
		{        
			lubInterface = cSetInterface;
			Info.data.ublanguage = lubIconSelected;
			lubIconSelected = 0;
			IicFlag.bit.mubInfoW = cTrue;
		}
		else if(Button.bit.ubEscPress)												//单击Esc键
		{        
				lubInterface = cSetInterface;
				lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress)												//单击Up键
		{       
			lubBlinkCnt = 10;			
			if(--lubIconSelected >= cMaxLanguage)
			{
				lubIconSelected = cITALIANO;
			}
		}
		else if(Button.bit.ubDownPress)												//单击Down键
		{        
			lubBlinkCnt = 10;
			if(++lubIconSelected >= cMaxLanguage)
			{
				lubIconSelected = cEnglish;
			}
		}
	}
	
	
	else if(lubInterface == cAutoTestSet)         //自检模式
	{
		luwNoOprateCnt = 0;
		if((Safty.data.uwCountry == cItaly )&&(PRJ_NUMBER == SUNNYBEE))
		{
			sAutoTestAsis(1);
			lubInterfacePre = cAutoTestSet;
		}
		else
		{
			lubInterface = cSetInterface;
		}
	}
	else if(lubInterface == cAutoTestResult)     //自检结果
	{
	
		if((Safty.data.uwCountry == cItaly )&&(PRJ_NUMBER == SUNNYBEE))
		{
			strcpy(lubString,"Test Time 20  -  -  ");
			lubString[12] = ((INT8U)AutoTestResult_Info.TEST_TIME[0] / 10) + 0x30;
			lubString[13] = ((INT8U)AutoTestResult_Info.TEST_TIME[0] % 10) + 0x30;
			lubString[15] = ((INT8U)(AutoTestResult_Info.TEST_TIME[0]>>8) / 10) + 0x30;
			lubString[16] = ((INT8U)(AutoTestResult_Info.TEST_TIME[0]>>8) % 10) + 0x30;
			lubString[18] = ((INT8U)AutoTestResult_Info.TEST_TIME[1]/ 10) + 0x30;
			lubString[19] = ((INT8U)AutoTestResult_Info.TEST_TIME[1] % 10) + 0x30;
			sWriteScreenBuf(0,0,20,lubString);
		
			strcpy(lubString,"            :  :    ");
			lubString[10] = ((INT8U)(AutoTestResult_Info.TEST_TIME[1]>>8) / 10) + 0x30;
			lubString[11] = ((INT8U)(AutoTestResult_Info.TEST_TIME[1]>>8) % 10) + 0x30;
			lubString[13] = ((INT8U)AutoTestResult_Info.TEST_TIME[2]/ 10) + 0x30;
			lubString[14] = ((INT8U)AutoTestResult_Info.TEST_TIME[2] % 10) + 0x30;
			lubString[16] = ((INT8U)(AutoTestResult_Info.TEST_TIME[2]>>8) / 10) + 0x30;
			lubString[17] = ((INT8U)(AutoTestResult_Info.TEST_TIME[2]>>8) % 10) + 0x30;
			sWriteScreenBuf(1,0,20,lubString);
			switch(lubIconSelected)
			{
				case 0:
				{
					strcpy(lubString,"27.S1       V     ms");
					sTransferData(1,__REV16(AutoTestResult_Info.ItalyResult[0].Trip_Value),&lubString[7],4);
					sDisplayAsist(7,10,lubString);	
					sTransferData(0,__REV16(AutoTestResult_Info.ItalyResult[0].Trip_Time),&lubString[14],4);
					sDisplayAsist(14,17,lubString);						
					sWriteScreenBuf(2,0,20,lubString);					
					strcpy(lubString,"27.S2       V     ms");
					sTransferData(1,__REV16(AutoTestResult_Info.ItalyResult[1].Trip_Value),&lubString[7],4);
					sDisplayAsist(7,10,lubString);	
					sTransferData(0,__REV16(AutoTestResult_Info.ItalyResult[1].Trip_Time),&lubString[14],4);
					sDisplayAsist(14,17,lubString);						
					sWriteScreenBuf(3,0,20,lubString);	
			
				}
				break;
				case 1:
				{
					strcpy(lubString,"59.S1       V     ms");
					sTransferData(1,__REV16(AutoTestResult_Info.ItalyResult[2].Trip_Value),&lubString[7],4);
					sDisplayAsist(7,10,lubString);	
					sTransferData(0,__REV16(AutoTestResult_Info.ItalyResult[2].Trip_Time),&lubString[14],4);
					sDisplayAsist(14,17,lubString);						
					sWriteScreenBuf(2,0,20,lubString);					
					strcpy(lubString,"59.S2       V     ms");
					sTransferData(1,__REV16(AutoTestResult_Info.ItalyResult[3].Trip_Value),&lubString[7],4);
					sDisplayAsist(7,10,lubString);	
					sTransferData(0,__REV16(AutoTestResult_Info.ItalyResult[3].Trip_Time),&lubString[14],4);
					sDisplayAsist(14,17,lubString);						
					sWriteScreenBuf(3,0,20,lubString);	
				}
				break;
				case 2:
				{
					strcpy(lubString,"81<S1      Hz     ms");
					sTransferData(2,(__REV16(AutoTestResult_Info.ItalyResult[4].Trip_Value)/10),&lubString[6],4);
					sDisplayAsist(6,9,lubString);	
					sTransferData(0,__REV16(AutoTestResult_Info.ItalyResult[4].Trip_Time),&lubString[14],4);
					sDisplayAsist(14,17,lubString);						
					sWriteScreenBuf(2,0,20,lubString);					
					strcpy(lubString,"81<S2      Hz     ms");
					sTransferData(2,(__REV16(AutoTestResult_Info.ItalyResult[5].Trip_Value)/10),&lubString[6],4);
					sDisplayAsist(6,9,lubString);	
					sTransferData(0,__REV16(AutoTestResult_Info.ItalyResult[5].Trip_Time),&lubString[14],4);
					sDisplayAsist(14,17,lubString);						
					sWriteScreenBuf(3,0,20,lubString);	
				}
				break;
				case 3:
				{
					strcpy(lubString,"81>S1      Hz     ms");
					sTransferData(2,(__REV16(AutoTestResult_Info.ItalyResult[6].Trip_Value)/10),&lubString[6],4);
					sDisplayAsist(6,9,lubString);	
					sTransferData(0,__REV16(AutoTestResult_Info.ItalyResult[6].Trip_Time),&lubString[14],4);
					sDisplayAsist(14,17,lubString);						
					sWriteScreenBuf(2,0,20,lubString);					
					strcpy(lubString,"81>S2      Hz     ms");
					sTransferData(2,(__REV16(AutoTestResult_Info.ItalyResult[7].Trip_Value)/10),&lubString[6],4);
					sDisplayAsist(6,9,lubString);	
					sTransferData(0,__REV16(AutoTestResult_Info.ItalyResult[7].Trip_Time),&lubString[14],4);
					sDisplayAsist(14,17,lubString);						
					sWriteScreenBuf(3,0,20,lubString);	
				}
				break;
				
			}
			if(Button.bit.ubEscPress)												//单击Esc键
			{        
				lubInterface = cSetInterface;
				lubIconSelected = 0;
			}
			else if(Button.bit.ubUpPress)											//单击Up键
			{        
				if(--lubIconSelected >= 4)
				{
					lubIconSelected = 3;
				}
			}
			else if(Button.bit.ubDownPress)											//单击Down键
			{        
				if(++lubIconSelected >= 4)
				{
					lubIconSelected = 0;
				}
			}
			else if(Button.bit.ubEnterPress)										//单击Enter键
			{        
				
