Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
			}	
		}
		else
		{
			lubInterface = cSetInterface;
		}
	}
	else if(lubInterface == cPasswordSet)         //密码设置
	{
		sWriteScreenBuf(0,0,20,"                    ");
		sWriteScreenBuf(1,0,20,"Set Password        ");
		strcpy(lubString,"                    ");
		
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
		}	
		if(lubIconSelected != 0 || lubBlinkCnt < 10)
		{
			lubString[6] = lubPasswordSet[0];
		}
		if(lubIconSelected != 1 || lubBlinkCnt < 10)
		{
			lubString[7] = lubPasswordSet[1];
		}
		if(lubIconSelected != 2 || lubBlinkCnt <10)
		{
			lubString[8] = lubPasswordSet[2];
		}
		if(lubIconSelected != 3 || lubBlinkCnt < 10)
		{
			lubString[9] = lubPasswordSet[3];
		}
		if(lubIconSelected != 4 || lubBlinkCnt < 10)
		{
			lubString[10] = lubPasswordSet[4];
		}
		if(lubIconSelected != 5 || lubBlinkCnt < 10)
		{
			lubString[11] = lubPasswordSet[5];
		}
		sWriteScreenBuf(2,0,20,lubString);
		sWriteScreenBuf(3,0,20,"                    ");
		
		if(Button.bit.ubEscPress)												//单击Esc键
		{        
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress)											//单击Up键
		{        
			if(++lubPasswordSet[lubIconSelected] > 0x39)
			{
				lubPasswordSet[lubIconSelected] = 0x30;
			}
		}
		else if(Button.bit.ubDownPress)											//单击Down键
		{        
			if(--lubPasswordSet[lubIconSelected] < 0x30)
			{
				lubPasswordSet[lubIconSelected] = 0x39;
			}
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{        
			if(++lubIconSelected >= 6)
			{
				lubIconSelected = 0;
				Info.data.ubPasswordH = (lubPasswordSet[0] - 0x30) * 16 + lubPasswordSet[1] - 0x30;
				Info.data.ubPasswordM = (lubPasswordSet[2] - 0x30) * 16 + lubPasswordSet[3] - 0x30;
				Info.data.ubPasswordL = (lubPasswordSet[4] - 0x30) * 16 + lubPasswordSet[5] - 0x30;
				lubInterface = cPasswordSaved;
				IicFlag.bit.mubInfoW = cTrue;
			
				for(i = 0;i < 6;i++)
				{
					lubPasswordSet[i] = 0x30;
				}
			}
			
		}
		
	}
	else if(lubInterface == cSaftySet)												//法规设置界面
	{		
		sWriteScreenBuf(0,0,9,"Country  ");
		sWriteScreenBuf(1,0,9,"Select   ");
		sWriteScreenBuf(2,0,9,"          ");
		sWriteScreenBuf(3,0,9,"          ");
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			sWriteScreenBuf(0,9,11,(INT8U *)lubSafty[lubSaftySort[lubIconSelected]]);
		}
		else if(lubBlinkCnt >= 10)
		{
			sWriteScreenBuf(0,9,11,"           ");
		}
		sWriteScreenBuf(1,9,11,(INT8U *)lubSafty[lubSaftySort[(lubIconSelected + 1) % cMaxSaftyCode]]);
		sWriteScreenBuf(2,9,11,(INT8U *)lubSafty[lubSaftySort[(lubIconSelected + 2) % cMaxSaftyCode]]);
		sWriteScreenBuf(3,9,11,(INT8U *)lubSafty[lubSaftySort[(lubIconSelected + 3) % cMaxSaftyCode]]);
		
		if(Button.bit.ubEnterPress)													//单击Enter键
		{  
			Safty.data.uwCountry = lubSaftySort[lubIconSelected];     
			if(PRJ_NUMBER == SUNNYBEE)
			{
				MF_usCountry = __REV16(Safty.data.uwCountry);      //国家安规
				write_10_date.usStartAddr = 0x2104;
				write_10_date.usLen = 1;
				FLAG_10_UPDATE = 1;
			}
			else if(PRJ_NUMBER == HORNET)
			{
				HF_usCountry = __REV16(Safty.data.uwCountry);      //国家安规
				write_10_date.usStartAddr = 0x2102;
				write_10_date.usLen = 1;
				FLAG_10_UPDATE = 1;
			}
			if(lubInterfacePre == cSaftyMessage)
			{
				lubInterface = cDefaultInterface;
				lubIconSelected = 0;
				Info.data.ubFirstTurnOn = cFalse;
				IicFlag.bit.mubInfoW = cTrue;
			}
			else
			{
				lubInterface = cSetInterface;
				lubIconSelected = 0;	
			}
		}
		else if(Button.bit.ubEscPress)												//单击Esc键
		{        
			if(lubInterfacePre != cSaftyMessage)
			{
				lubInterface = cSetInterface;
				lubIconSelected = 0;
			}
		}
		else if(Button.bit.ubDownPress || Button.bit.ubUpLongPress)												//单击Up键
		{        
			if(++lubIconSelected >= cMaxSaftyCode)
			{
				lubIconSelected = cUK;
			}
		}
		else if(Button.bit.ubUpPress || Button.bit.ubDownLongPress)												//单击Down键
		{        
			if(--lubIconSelected >= cMaxSaftyCode)
			{
				lubIconSelected = cLuxembourg;
			}
		}
		
	}
	else if(lubInterface == cProtectionSet)       //保护设置
	{
		sWriteScreenBuf(0,0,20,"Protection Set      ");
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			if(PRJ_NUMBER == SUNNYBEE)	
			{
				if(lubIconSelected <= 11)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)MF_Protection_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)MF_Protection_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)MF_Protection_Set[(2 + lubIconSelected) ]);
				}
				if(lubIconSelected == 12)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)MF_Protection_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)MF_Protection_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)MF_Protection_Set[0]);
				}
				if(lubIconSelected == 13)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)MF_Protection_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)MF_Protection_Set[0]);
					sWriteScreenBuf(3,0,20,(INT8U *)MF_Protection_Set[1]);
				}
			}
			else if(PRJ_NUMBER == HORNET)
			{
				if(lubIconSelected <= 10)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)HF_Protection_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)HF_Protection_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)HF_Protection_Set[(2 + lubIconSelected) ]);
				}
				if(lubIconSelected == 11)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)HF_Protection_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)HF_Protection_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)HF_Protection_Set[0]);
				}
				if(lubIconSelected == 12)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)HF_Protection_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)HF_Protection_Set[0]);
					sWriteScreenBuf(3,0,20,(INT8U *)HF_Protection_Set[1]);
				}
			}
			else
			{
				sWriteScreenBuf(1,0,20,"                    ");
				sWriteScreenBuf(2,0,20,"                    ");
				sWriteScreenBuf(3,0,20,"                    ");
			}
		}	
		else if(lubBlinkCnt >= 10)
		{
			sWriteScreenBuf(1,0,20,"                    ");
		}
		if(PRJ_NUMBER == SUNNYBEE)	
		{
			switch(lubIconSelected)
			{
				case 0:
				{
					switch(luwProtectionSet[0])
					{
						case 0xAA:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						case 0x55:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;
							
