Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
					}
					sWriteScreenBuf(2,15,20,"< NC>");
					sWriteScreenBuf(3,15,20,"< NC>");
				}
					break;
				case 1:
				{
					sWriteScreenBuf(1,15,20,"< NC>");
					sWriteScreenBuf(2,15,20,"< NC>");
					sWriteScreenBuf(3,15,20,"< NC>");
				}
					break;
				case 2:
				{
					sWriteScreenBuf(1,15,20,"< NC>");
					sWriteScreenBuf(2,15,20,"< NC>");
					sWriteScreenBuf(3,15,20,"< NC>");
				}
					break;
				case 3:
				{
					sWriteScreenBuf(1,15,20,"< NC>");
					sWriteScreenBuf(2,15,20,"< NC>");
					switch(luwProtectionSet[5])
					{
						case 0x55:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						case 0xAA:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;
							
					}
				}
					break;
				case 4:
				{
					sWriteScreenBuf(1,15,20,"< NC>");				
					switch(luwProtectionSet[5])
					{
						case 0x55:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						case 0xAA:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;		
					}
				sWriteScreenBuf(3,15,20,"< NC>");
				}
					break;
				case 5:
				{			
					switch(luwProtectionSet[5])
					{
						case 0x55:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						case 0xAA:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;		
					}
				sWriteScreenBuf(2,15,20,"< NC>");	
				sWriteScreenBuf(3,15,20,"< NC>");
				}
					break;
				case 6:
				{					
				 sWriteScreenBuf(1,15,20,"< NC>");	
				 sWriteScreenBuf(2,15,20,"< NC>");
					switch(luwProtectionSet[8])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"CLOSE");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"27.S1");
						break;
						case 2:
							sWriteScreenBuf(3,15,20,"27.S2");
						break;
						case 3:
							sWriteScreenBuf(3,15,20,"59.S1");
						break;
						case 4:
							sWriteScreenBuf(3,15,20,"59.S2");
						break;
						case 5:
							sWriteScreenBuf(3,15,20,"81<S1");
						break;
						case 6:
							sWriteScreenBuf(3,15,20,"81<S2");
						break;
						case 7:
							sWriteScreenBuf(3,15,20,"81>S1");
						break;
						case 8:
							sWriteScreenBuf(3,15,20,"81>S2");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;		
					}
				}
					break;
				case 7:
				{					
				 sWriteScreenBuf(1,15,20,"< NC>");	
					switch(luwProtectionSet[8])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"CLOSE");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"27.S1");
						break;
						case 2:
							sWriteScreenBuf(2,15,20,"27.S2");
						break;
						case 3:
							sWriteScreenBuf(2,15,20,"59.S1");
						break;
						case 4:
							sWriteScreenBuf(2,15,20,"59.S2");
						break;
						case 5:
							sWriteScreenBuf(2,15,20,"81<S1");
						break;
						case 6:
							sWriteScreenBuf(2,15,20,"81<S2");
						break;
						case 7:
							sWriteScreenBuf(2,15,20,"81>S1");
						break;
						case 8:
							sWriteScreenBuf(2,15,20,"81>S2");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;		
					}
				 sWriteScreenBuf(3,15,20,"< NC>");
				}
					break;
				case 8:
				{					
					switch(luwProtectionSet[8])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"CLOSE");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"27.S1");
						break;
						case 2:
							sWriteScreenBuf(1,15,20,"27.S2");
						break;
						case 3:
							sWriteScreenBuf(1,15,20,"59.S1");
						break;
						case 4:
							sWriteScreenBuf(1,15,20,"59.S2");
						break;
						case 5:
							sWriteScreenBuf(1,15,20,"81<S1");
						break;
						case 6:
							sWriteScreenBuf(1,15,20,"81<S2");
						break;
						case 7:
							sWriteScreenBuf(1,15,20,"81>S1");
						break;
						case 8:
							sWriteScreenBuf(1,15,20,"81>S2");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;		
					}
				 sWriteScreenBuf(2,15,20,"< NC>");
				 switch(luwProtectionSet[10])
					{
						case 0x55:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						case 0xAA:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;		
					}
				}
					break;
				case 9:
				{
				 sWriteScreenBuf(1,15,20,"< NC>");
				 switch(luwProtectionSet[10])
					{
						case 0x55:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						case 0xAA:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;		
					}
				 sWriteScreenBuf(3,15,20,"< NC>");
				}
				 break;
				case 10:
				{
				 switch(luwProtectionSet[10])
					{
						case 0x55:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						case 0xAA:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;		
					}
				 sWriteScreenBuf(2,15,20,"< NC>");
				 sWriteScreenBuf(3,15,20,"< NC>");
				}
				 break;
				case 11:
				{
				 sWriteScreenBuf(1,15,20,"< NC>");
				 sWriteScreenBuf(2,15,20,"< NC>");
				 sTransferData(0,luwProtectionSet[13],&lubString[16],4);
				 sWriteScreenBuf(3,16,20,&lubString[16]);
				}
				 break;
				case 12:
				{
				 sWriteScreenBuf(1,15,20,"< NC>");
				 sTransferData(0,luwProtectionSet[13],&lubString[16],4);
				 sWriteScreenBuf(2,16,20,&lubString[16]);		 
				 switch(luwProtectionSet[0])
					{
						case 0xAA:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						case 0x55:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;		
					}
				}
				 break;
				case 13:
				{
				 sTransferData(0,luwProtectionSet[13],&lubString[16],4);
				 sWriteScreenBuf(1,16,20,&lubString[16]);		 
				 switch(luwProtectionSet[0])
					{
						case 0xAA:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						case 0x55:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;		
					}
			   sWriteScreenBuf(3,15,20,"< NC>");
				}
				 break;
			}			
		}
		else if(PRJ_NUMBER == HORNET)	
		{
			switch(lubIconSelected)
			{
				case 0:
				{
					switch(luwProtectionSet[0])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[1])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[2])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 1:
				{
					switch(luwProtectionSet[1])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[2])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[3])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 2:
				{
					switch(luwProtectionSet[2])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[3])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[4])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 3:
				{
					switch(luwProtectionSet[3])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[4])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[5])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 4:
				{
					switch(luwProtectionSet[4])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[5])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[6])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 5:
				{
					switch(luwProtectionSet[5])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[6])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[7])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 6:
				{
					switch(luwProtectionSet[6])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[7])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[8])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"CLOSE");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"27.S1");
						break;
						case 2:
							sWriteScreenBuf(3,15,20,"27.S2");
						break;
						case 3:
							sWriteScreenBuf(3,15,20,"59.S1");
						break;
						case 4:
							sWriteScreenBuf(3,15,20,"59.S2");
						break;
						case 5:
							sWriteScreenBuf(3,15,20,"81<S1");
						break;
						case 6:
							sWriteScreenBuf(3,15,20,"81<S2");
						break;
						case 7:
							sWriteScreenBuf(3,15,20,"81>S1");
						break;
						case 8:
							sWriteScreenBuf(3,15,20,"81>S2");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;		
					}
				}
					break;
				case 7:
				{
					switch(luwProtectionSet[7])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[8])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"CLOSE");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"27.S1");
						break;
						case 2:
							sWriteScreenBuf(2,15,20,"27.S2");
						break;
						case 3:
							sWriteScreenBuf(2,15,20,"59.S1");
						break;
						case 4:
							sWriteScreenBuf(2,15,20,"59.S2");
						break;
						case 5:
							sWriteScreenBuf(2,15,20,"81<S1");
						break;
						case 6:
							sWriteScreenBuf(2,15,20,"81<S2");
						break;
						case 7:
							sWriteScreenBuf(2,15,20,"81>S1");
						break;
						case 8:
							sWriteScreenBuf(2,15,20,"81>S2");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;		
					}
					switch(luwProtectionSet[9])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 8:
				{
					switch(luwProtectionSet[8])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"CLOSE");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"27.S1");
						break;
						case 2:
							sWriteScreenBuf(1,15,20,"27.S2");
						break;
						case 3:
							sWriteScreenBuf(1,15,20,"59.S1");
						break;
						case 4:
							sWriteScreenBuf(1,15,20,"59.S2");
						break;
						case 5:
							sWriteScreenBuf(1,15,20,"81<S1");
						break;
						case 6:
							sWriteScreenBuf(1,15,20,"81<S2");
						break;
						case 7:
							sWriteScreenBuf(1,15,20,"81>S1");
						break;
						case 8:
							sWriteScreenBuf(1,15,20,"81>S2");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;		
					}
					switch(luwProtectionSet[9])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[10])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 9:
				{
					switch(luwProtectionSet[9])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[10])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[11])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 10:
				{
					switch(luwProtectionSet[10])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[11])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[12])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 11:
				{
					switch(luwProtectionSet[11])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[12])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[0])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
				case 12:
				{
					switch(luwProtectionSet[12])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[0])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					switch(luwProtectionSet[1])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
					break;
			}			
		}
		if(Button.bit.ubEscPress)												//单击Esc键
		{        
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress || Button.bit.ubUpLongPress)											//单击Up键
		{   
			if(++luwProtectionSet[lubIconSelected] > luwProtectionSetMax[lubIconSelected])
			{
				luwProtectionSet[lubIconSelected] = luwProtectionSetMin[lubIconSelected];
			}	
		}
		else if(Button.bit.ubDownPress || Button.bit.ubDownLongPress)											//单击Down键
		{        
			if(--luwProtectionSet[lubIconSelected] > luwProtectionSetMax[lubIconSelected])
			{
				luwProtectionSet[lubIconSelected] = luwProtectionSetMax[lubIconSelected];
			}
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{  
			lubBlinkCnt	= 10;		
			if(PRJ_NUMBER == SUNNYBEE)
			{
				if(++lubIconSelected > 13)
				{
					lubIconSelected = 0;
				}
			}
			else if(PRJ_NUMBER == HORNET)
			{
				if(++lubIconSelected > 12)
				{
					lubIconSelected = 0;
				}
			}
		}
		else if(Button.bit.ubEnterLongPress)									//长按Enter键
		{
			*Protection_Func_Enable_Info.ActiveAntiIslandingEn = __REV16(luwProtectionSet[0]);    //保护使能
			*Protection_Func_Enable_Info.GfciEn = __REV16(luwProtectionSet[1]);
			*Protection_Func_Enable_Info.IsoCheckEn = __REV16(luwProtectionSet[2]);
			*Protection_Func_Enable_Info.DcInjectionEn = __REV16(luwProtectionSet[3]);
			*Protection_Func_Enable_Info.GridVoltProtThresAutoAdjEn = __REV16(luwProtectionSet[4]);
			*Protection_Func_Enable_Info.GridVoltHighPwrDeratedEn = __REV16(luwProtectionSet[5]);
			*Protection_Func_Enable_Info.GlobalMpptScanEn = __REV16(luwProtectionSet[6]);
			*Protection_Func_Enable_Info.PvVICurveEn = __REV16(luwProtectionSet[7]);
			*Protection_Func_Enable_Info.ItalySelfTestEN = __REV16(luwProtectionSet[8]);
			*Protection_Func_Enable_Info.PidFuncEn = __REV16(luwProtectionSet[9]);
			*Protection_Func_Enable_Info.DrmFuncEn = __REV16(luwProtectionSet[10]);
			*Protection_Func_Enable_Info.ArcDetectEn = __REV16(luwProtectionSet[11]);
			*Protection_Func_Enable_Info.ArcResetEn = __REV16(luwProtectionSet[12]);
			if(PRJ_NUMBER == SUNNYBEE)
			{
				*Protection_Func_Enable_Info.ZeroExpPercent = __REV16(luwProtectionSet[13]);
				write_10_date.usStartAddr = 0x213F;
				write_10_date.usLen = 25;
				FLAG_10_UPDATE = 1;
			}
			else if(PRJ_NUMBER == HORNET)
			{
				*Protection_Func_Enable_Info.ReconnectPwrRampUpEn = __REV16(luwProtectionSet[13]);
				*Protection_Func_Enable_Info.AntiRefluxPwrPercent = __REV16(luwProtectionSet[14]);
				write_10_date.usStartAddr = 0x2482;
				write_10_date.usLen = 15;
				FLAG_10_UPDATE = 1;
			}
			
			while(cGetButtonEnter());
			Button.all &= 0x0000;
			lubIconSelected = 0;
			lubInterface = cSetInterface;
		}
		if(PRJ_NUMBER == SUNNYBEE)
		{
			for(i = 0;i < 13;i++)
			{
				if((luwProtectionSet[i] == 0xA9)||(luwProtectionSet[i] == 0xAB))
				luwProtectionSet[i] = luwProtectionSetMin[i];
				if((luwProtectionSet[i] == 0x54)||(luwProtectionSet[i] == 0x56))
					luwProtectionSet[i] = luwProtectionSetMax[i];
			}
			
			if(luwProtectionSet[13] >luwProtectionSetMax[13])
				luwProtectionSet[13] = luwProtectionSetMin[13];
			if(luwProtectionSet[13] <luwProtectionSetMin[13])
				luwProtectionSet[13] = luwProtectionSetMax[13];
		}
		else if(PRJ_NUMBER == HORNET)
		{
		
			if(luwProtectionSet[14] >luwProtectionSetMax[14])
				luwProtectionSet[14] = luwProtectionSetMin[14];
			if(luwProtectionSet[14] <luwProtectionSetMin[14])
				luwProtectionSet[14] = luwProtectionSetMax[14];
		}
	}
	
	
