Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
	else if(lubInterface == cParamSet)              //通用参数设置
	{
		sWriteScreenBuf(0,0,20,"Parameter Set       ");
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			if(PRJ_NUMBER == SUNNYBEE)
			{
				if(lubIconSelected <= 2)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)MF_Param_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)MF_Param_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)MF_Param_Set[(2 + lubIconSelected) ]);
				}
				if(lubIconSelected == 3)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)MF_Param_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)MF_Param_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)MF_Param_Set[0]);
				}
				if(lubIconSelected == 4)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)MF_Param_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)MF_Param_Set[0]);
					sWriteScreenBuf(3,0,20,(INT8U *)MF_Param_Set[1]);
				}
			}
			else if(PRJ_NUMBER == HORNET)
			{
				if(lubIconSelected <= 1)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)HF_Param_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)HF_Param_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)HF_Param_Set[(2 + lubIconSelected) ]);
				}
				if(lubIconSelected == 2)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)HF_Param_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)HF_Param_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)HF_Param_Set[0]);
				}
				if(lubIconSelected == 3)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)HF_Param_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)HF_Param_Set[0]);
					sWriteScreenBuf(3,0,20,(INT8U *)HF_Param_Set[1]);
				}
			}
			else
			{
				sWriteScreenBuf(1,0,20,"                    ");
				sWriteScreenBuf(2,0,20,"                    ");
				sWriteScreenBuf(3,0,20,"                    ");
			}
		}
		else if(lubBlinkCnt >= 10)
		{
			sWriteScreenBuf(1,0,20,"                    ");
		}
			if(PRJ_NUMBER == SUNNYBEE)
			{
				switch(lubIconSelected)
				{
					case 0:
					{	
						sTransferData(0,luwParamSet[0],&lubString[16],4);
						sWriteScreenBuf(1,16,20,&lubString[16]);
						switch(luwParamSet[1])
						{
							case 0x55:
								sWriteScreenBuf(2,10,20,"       OFF");
							break;
							case 0xA1:
								sWriteScreenBuf(2,10,20,"    PF SET");
							break;
							case 0xA2:
								sWriteScreenBuf(2,10,20," Cosphi(P)");
							break;
							case 0xA3:
								sWriteScreenBuf(2,10,20,"        Qp");
							break;
							case 0xA4:
								sWriteScreenBuf(2,10,20,"        Qu");
							break;
							default:
								sWriteScreenBuf(2,10,20,"   Default");
							break;							
						}
						if((luwParamSet[2]&0x8000) == 0)
						{
							sTransferData(0,luwParamSet[2],&lubString[16],4);
							sWriteScreenBuf(3,16,20,&lubString[16]);
						}
						else
						{
							sWriteScreenBuf(3,15,16,"-");
							luwParamSetTemp = 65536-luwParamSet[2];
							sTransferData(0,luwParamSetTemp,&lubString[16],4);
							sWriteScreenBuf(3,16,20,&lubString[16]);
						}		
					}
					break;
					case 1:
					{	
						switch(luwParamSet[1])
						{
							case 0x55:
								sWriteScreenBuf(1,10,20,"       OFF");
							break;
							case 0xA1:
								sWriteScreenBuf(1,10,20,"    PF SET");
							break;
							case 0xA2:
								sWriteScreenBuf(1,10,20," Cosphi(P)");
							break;
							case 0xA3:
								sWriteScreenBuf(1,10,20,"        Qp");
							break;
							case 0xA4:
								sWriteScreenBuf(1,10,20,"        Qu");
							break;	
							default:
								sWriteScreenBuf(1,10,20,"   Default");
							break;
						}
						if((luwParamSet[2]&0x8000) == 0)
						{
							sTransferData(0,luwParamSet[2],&lubString[16],4);
							sWriteScreenBuf(2,16,20,&lubString[16]);
						}
						else
						{
							sWriteScreenBuf(2,15,16,"-");
							luwParamSetTemp = 65536-luwParamSet[2];
							sTransferData(0,luwParamSetTemp,&lubString[16],4);
							sWriteScreenBuf(2,16,20,&lubString[16]);
						}		
						if((luwParamSet[3]&0x8000) == 0)
						{
							sTransferData(0,luwParamSet[3],&lubString[16],4);
							sWriteScreenBuf(3,16,20,&lubString[16]);
						}
						else
						{
							sWriteScreenBuf(3,15,16,"-");
							luwParamSetTemp = 65536-luwParamSet[3];
							sTransferData(0,luwParamSetTemp,&lubString[16],4);
							sWriteScreenBuf(3,16,20,&lubString[16]);
						}		
					}
					break;
					case 2:
					{	
						if((luwParamSet[2]&0x8000) == 0)
						{
							sTransferData(0,luwParamSet[2],&lubString[16],4);
							sWriteScreenBuf(1,16,20,&lubString[16]);
						}
						else
						{
							sWriteScreenBuf(1,15,16,"-");
							luwParamSetTemp = 65536-luwParamSet[2];
							sTransferData(0,luwParamSetTemp,&lubString[16],4);
							sWriteScreenBuf(1,16,20,&lubString[16]);
						}		
						if((luwParamSet[3]&0x8000) == 0)
						{
							sTransferData(0,luwParamSet[3],&lubString[16],4);
							sWriteScreenBuf(2,16,20,&lubString[16]);
						}
						else
						{
							sWriteScreenBuf(2,15,16,"-");
							luwParamSetTemp = 65536-luwParamSet[3];
							sTransferData(0,luwParamSetTemp,&lubString[16],4);
							sWriteScreenBuf(2,16,20,&lubString[16]);
						}		
						switch(luwParamSet[4])
						{
							case 0x55:
								sWriteScreenBuf(3,10,20,"   Level 2");
							break;
							case 0xAA:
								sWriteScreenBuf(3,10,20,"   Level 1");
							break;
							default:
								sWriteScreenBuf(3,10,20,"   Default");
							break;
						}
					}
					break;
					case 3:
					{	
						if((luwParamSet[3]&0x8000) == 0)
						{
							sTransferData(0,luwParamSet[3],&lubString[16],4);
							sWriteScreenBuf(1,16,20,&lubString[16]);
						}
						else
						{
							sWriteScreenBuf(1,15,16,"-");
							luwParamSetTemp = 65536-luwParamSet[3];
							sTransferData(0,luwParamSetTemp,&lubString[16],4);
							sWriteScreenBuf(1,16,20,&lubString[16]);
						}		
						switch(luwParamSet[4])
						{
							case 0x55:
								sWriteScreenBuf(2,10,20,"   Level 2");
							break;
							case 0xAA:
								sWriteScreenBuf(2,10,20,"   Level 1");
							break;
							default:
								sWriteScreenBuf(2,10,20,"   Default");
							break;
						}
						sTransferData(0,luwParamSet[0],&lubString[16],4);
						sWriteScreenBuf(3,16,20,&lubString[16]);
					}
					break;
					case 4:
					{	
						switch(luwParamSet[4])
						{
							case 0x55:
								sWriteScreenBuf(1,10,20,"   Level 2");
							break;
							case 0xAA:
								sWriteScreenBuf(1,10,20,"   Level 1");
							break;
							default:
								sWriteScreenBuf(1,10,20,"   Default");
							break;
						}
						sTransferData(0,luwParamSet[0],&lubString[16],4);
						sWriteScreenBuf(2,16,20,&lubString[16]);
						switch(luwParamSet[1])
						{
							case 0x55:
								sWriteScreenBuf(3,10,20,"       OFF");
							break;
							case 0xA1:
								sWriteScreenBuf(3,10,20,"    PF SET");
							break;
							case 0xA2:
								sWriteScreenBuf(3,10,20," Cosphi(P)");
							break;
							case 0xA3:
								sWriteScreenBuf(3,10,20,"        Qp");
							break;
							case 0xA4:
								sWriteScreenBuf(3,10,20,"        Qu");
							break;	
							default:
								sWriteScreenBuf(3,10,20,"   Default");
							break;
						}
					}
					break;
				}
			}
			else if(PRJ_NUMBER == HORNET)
			{
				switch(lubIconSelected)
				{
				case 0:
				{	
					sTransferData(0,luwParamSet[0],&lubString[16],4);
					sWriteScreenBuf(1,16,20,&lubString[16]);
					switch(luwParamSet[1])
					{
						case 0:
							sWriteScreenBuf(2,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(2,15,20,"<DEF>");
						break;						
					}
					if((luwParamSet[2]&0x8000) == 0)
					{
						sTransferData(0,luwParamSet[2],&lubString[16],4);
						sWriteScreenBuf(3,16,20,&lubString[16]);
					}
					else
					{
						sWriteScreenBuf(3,15,16,"-");
						luwParamSetTemp = 65536-luwParamSet[2];
						sTransferData(0,luwParamSetTemp,&lubString[16],4);
						sWriteScreenBuf(3,16,20,&lubString[16]);
					}		
				}
				break;
				case 1:
				{	
					switch(luwParamSet[1])
					{
						case 0:
							sWriteScreenBuf(1,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(1,15,20,"<DEF>");
						break;						
					}
					if((luwParamSet[2]&0x8000) == 0)
					{
						sTransferData(0,luwParamSet[2],&lubString[16],4);
						sWriteScreenBuf(2,16,20,&lubString[16]);
					}
					else
					{
						sWriteScreenBuf(2,15,16,"-");
						luwParamSetTemp = 65536-luwParamSet[2];
						sTransferData(0,luwParamSetTemp,&lubString[16],4);
						sWriteScreenBuf(2,16,20,&lubString[16]);
					}		
					if((luwParamSet[3]&0x8000) == 0)
					{
						sTransferData(0,luwParamSet[3],&lubString[16],4);
						sWriteScreenBuf(3,16,20,&lubString[16]);
					}
					else
					{
						sWriteScreenBuf(3,15,16,"-");
						luwParamSetTemp = 65536-luwParamSet[3];
						sTransferData(0,luwParamSetTemp,&lubString[16],4);
						sWriteScreenBuf(3,16,20,&lubString[16]);
					}		
				}
				break;
				case 2:
				{
					if((luwParamSet[2]&0x8000) == 0)
					{
						sTransferData(0,luwParamSet[2],&lubString[16],4);
						sWriteScreenBuf(1,16,20,&lubString[16]);
					}
					else
					{
						sWriteScreenBuf(1,15,16,"-");
						luwParamSetTemp = 65536-luwParamSet[2];
						sTransferData(0,luwParamSetTemp,&lubString[16],4);
						sWriteScreenBuf(1,16,20,&lubString[16]);
					}		
					if((luwParamSet[3]&0x8000) == 0)
					{
						sTransferData(0,luwParamSet[3],&lubString[16],4);
						sWriteScreenBuf(2,16,20,&lubString[16]);
					}
					else
					{
						sWriteScreenBuf(2,15,16,"-");
						luwParamSetTemp = 65536-luwParamSet[3];
						sTransferData(0,luwParamSetTemp,&lubString[16],4);
						sWriteScreenBuf(2,16,20,&lubString[16]);
					}		
					sTransferData(0,luwParamSet[0],&lubString[16],4);
					sWriteScreenBuf(3,16,20,&lubString[16]);
				}
				break;
				case 3:
				{
					if((luwParamSet[3]&0x8000) == 0)
					{
						sTransferData(0,luwParamSet[3],&lubString[16],4);
						sWriteScreenBuf(1,16,20,&lubString[16]);
					}
					else
					{
						sWriteScreenBuf(1,15,16,"-");
						luwParamSetTemp = 65536-luwParamSet[3];
						sTransferData(0,luwParamSetTemp,&lubString[16],4);
						sWriteScreenBuf(1,16,20,&lubString[16]);
					}		
					sTransferData(0,luwParamSet[0],&lubString[16],4);
					sWriteScreenBuf(2,16,20,&lubString[16]);
					switch(luwParamSet[1])
					{
						case 0:
							sWriteScreenBuf(3,15,20,"< N0>");
						break;
						case 1:
							sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
							sWriteScreenBuf(3,15,20,"<DEF>");
						break;						
					}
				}
				break;
			}			
		}
			
