Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
		if(Button.bit.ubEnterPress)													//单击Enter键
		{     
			lubBlinkCnt = 10;
			if(PRJ_NUMBER == SUNNYBEE)
			{
				if(++lubIconSelected > 4)
				{
					lubIconSelected = 0;
				}
			}
			if(PRJ_NUMBER == HORNET)
			{
				if(++lubIconSelected > 3)
				{
					lubIconSelected = 0;
				}
			}
		}
		else if(Button.bit.ubEscPress)												//单击Esc键
		{        		
				lubInterface = cSetInterface;
				lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress || Button.bit.ubUpLongPress)												//单击Up键
		{       		
			if(++luwParamSet[lubIconSelected] > luwParamSetMax[lubIconSelected])
			{
				luwParamSet[lubIconSelected] = luwParamSetMin[lubIconSelected];
			}			
		}
		else if(Button.bit.ubDownPress || Button.bit.ubDownLongPress)												//单击Down键
		{        
			if(--luwParamSet[lubIconSelected] < luwParamSetMin[lubIconSelected])
			{
				luwParamSet[lubIconSelected] = luwParamSetMax[lubIconSelected];
			}
		}
		else if(Button.bit.ubEnterLongPress)									//长按Enter键
		{
			if(PRJ_NUMBER == SUNNYBEE)
			{
				*Param_Set_Info.MActPwrSetValue = __REV16(luwParamSet[0]);     //通用设置
				*Param_Set_Info.MReactPwrModeEn = __REV16(luwParamSet[1]);
				*Param_Set_Info.MPowerFactorSetVal = __REV16(luwParamSet[2]);
				*Param_Set_Info.MReactPwrSetValue = __REV16(luwParamSet[3]);
				*Param_Set_Info.MItalyOutsideCommFlag = __REV16(luwParamSet[4]);
				write_10_date.usStartAddr = 0x211C;
				write_10_date.usLen = 9;
				FLAG_10_UPDATE = 1;
			}
			else if(PRJ_NUMBER == HORNET)
			{
				*Param_Set_Info.HMaxOutputPwrPercent = __REV16(luwParamSet[0]);     //通用设置
				*Param_Set_Info.HReactPwrModeEn = __REV16(luwParamSet[1]);
				*Param_Set_Info.HPowerFactorSetVal = __REV16(luwParamSet[2]);
				*Param_Set_Info.HReactPwrQPercent = __REV16(luwParamSet[3]);	
				write_10_date.usStartAddr = 0x2303;
				write_10_date.usLen = 7;
				FLAG_10_UPDATE = 1;
			}
			while(cGetButtonEnter());
			Button.all &= 0x0000;
			lubIconSelected = 0;
			lubInterface = cSetInterface;
		}
		if(PRJ_NUMBER == SUNNYBEE)
		{
			if(luwParamSet[1] < 0xA1)
				luwParamSet[1] = luwParamSetMin[1];
			if(luwParamSet[1] == 0x56)
				luwParamSet[1] = 0xA1;
		}
		else if(PRJ_NUMBER == HORNET)
		{
			if(luwParamSet[1] > 1)
				luwParamSet[1] = luwParamSetMax[1];
		}
		
	}
	else if(lubInterface == cCurveSet)                    //曲线设置
	{
		sWriteScreenBuf(0,0,20,"Curve Set           ");
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			if(PRJ_NUMBER == SUNNYBEE)
			{
				sWriteScreenBuf(1,0,20,(INT8U *)Curve_Set[0]);
				sWriteScreenBuf(2,0,20,"                    ");
				sWriteScreenBuf(3,0,20,"                    ");
			}
			if(PRJ_NUMBER == HORNET)
			{
				if(lubIconSelected <= 7)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)Curve_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)Curve_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)Curve_Set[(2 + lubIconSelected) ]);
				}
				if(lubIconSelected == 8)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)Curve_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)Curve_Set[(1 + lubIconSelected) ]);
					sWriteScreenBuf(3,0,20,(INT8U *)Curve_Set[0]);
				}
				if(lubIconSelected == 9)
				{
					sWriteScreenBuf(1,0,20,(INT8U *)Curve_Set[lubIconSelected ]);
					sWriteScreenBuf(2,0,20,(INT8U *)Curve_Set[0]);
					sWriteScreenBuf(3,0,20,(INT8U *)Curve_Set[1]);
				}
			}	
			else
			{
				sWriteScreenBuf(1,0,20,"                    ");
				sWriteScreenBuf(2,0,20,"                    ");
				sWriteScreenBuf(3,0,20,"                    ");
			}			
		}
		else if(lubBlinkCnt >= 10)
		{
			sWriteScreenBuf(1,0,20,"                    ");
		}
		if(PRJ_NUMBER == SUNNYBEE)
		{
			switch(luwCurveSet[0])
			{
				case 0xAA:
						sWriteScreenBuf(1,15,20,"<YES>");
				break;
				case 0x55:
						sWriteScreenBuf(1,15,20,"< NO>");
				break;
				default:
						sWriteScreenBuf(1,15,20,"<DEF>");
				break;	
			}
		}
		else if(PRJ_NUMBER == HORNET)
		{
			switch(lubIconSelected)
			{
				case 0:
				{
					switch(luwCurveSet[0])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[1])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[2])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 1:
				{
					switch(luwCurveSet[1])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[2])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[3])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 2:
				{
					switch(luwCurveSet[2])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[3])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[4])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 3:
				{
					switch(luwCurveSet[3])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[4])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[5])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 4:
				{
					switch(luwCurveSet[4])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[5])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[6])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 5:
				{
					switch(luwCurveSet[5])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[6])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[7])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 6:
				{
					switch(luwCurveSet[6])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[7])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[8])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 7:
				{
					switch(luwCurveSet[7])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[8])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[9])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 8:
				{
					switch(luwCurveSet[8])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[9])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[0])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
				case 9:
				{
					switch(luwCurveSet[9])
					{
						case 0:
						    sWriteScreenBuf(1,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(1,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(1,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[0])
					{
						case 0:
						    sWriteScreenBuf(2,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(2,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(2,15,20,"<DEF>");
						break;	
					}
					switch(luwCurveSet[1])
					{
						case 0:
						    sWriteScreenBuf(3,15,20,"< NO>");
						break;
						case 1:
								sWriteScreenBuf(3,15,20,"<YES>");
						break;
						default:
								sWriteScreenBuf(3,15,20,"<DEF>");
						break;	
					}
				}
				break;
			}		
		}
		if(Button.bit.ubEnterPress)													//单击Enter键
		{     
			lubBlinkCnt = 10;
			if(PRJ_NUMBER == SUNNYBEE)
			{
				lubIconSelected = 0;
			}
			else if(PRJ_NUMBER == HORNET)
			{
				if(++lubIconSelected > 9)
				{
					lubIconSelected = 0;
				}
			}
		}
		else if(Button.bit.ubEscPress)												//单击Esc键
		{        		
				lubInterface = cSetInterface;
				lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress || Button.bit.ubUpLongPress)												//单击Up键
		{    
			if(PRJ_NUMBER == SUNNYBEE)
			{
				if(++luwCurveSet[lubIconSelected] > luwCurveSetMax[lubIconSelected])
				{
					luwCurveSet[lubIconSelected] = luwCurveSetMin[lubIconSelected];
				}		
			}			
			else if(PRJ_NUMBER == HORNET)
			{
				if(++luwCurveSet[lubIconSelected] > luwCurveSetMax[lubIconSelected])
				{
					luwCurveSet[lubIconSelected] = luwCurveSetMin[lubIconSelected];
				}	
			}
		}
		else if(Button.bit.ubDownPress || Button.bit.ubDownLongPress)												//单击Down键
		{    
			if(PRJ_NUMBER == SUNNYBEE)
			{
				if(--luwCurveSet[lubIconSelected] < luwCurveSetMin[lubIconSelected])
				{
					luwCurveSet[lubIconSelected] = luwCurveSetMax[lubIconSelected];
				}
			}
			else if(PRJ_NUMBER == HORNET)
			{
				if(--luwCurveSet[lubIconSelected] > luwCurveSetMax[lubIconSelected])
				{
					luwCurveSet[lubIconSelected] = luwCurveSetMax[lubIconSelected];
				}
			}
		}
		else if(Button.bit.ubEnterLongPress)									//长按Enter键
		{
			*Curve_Enable_Info.WattFreqModeEn = __REV16(luwCurveSet[0]); //曲线使能
			*Curve_Enable_Info.WattVoltModeEn = __REV16(luwCurveSet[1]);
			*Curve_Enable_Info.PfWattModeEn = __REV16(luwCurveSet[2]);
			*Curve_Enable_Info.VarVoltModeEn = __REV16(luwCurveSet[3]);
			*Curve_Enable_Info.VarWattModeEn = __REV16(luwCurveSet[4]);
			*Curve_Enable_Info.ResvModeEn = __REV16(luwCurveSet[5]);
			*Curve_Enable_Info.LVRTCurveEn = __REV16(luwCurveSet[6]);
			*Curve_Enable_Info.HVRTCurveEn = __REV16(luwCurveSet[7]);
			*Curve_Enable_Info.LFRTCurveEn = __REV16(luwCurveSet[8]);
			*Curve_Enable_Info.HFRTCurveEn = __REV16(luwCurveSet[9]);
			if(PRJ_NUMBER == SUNNYBEE)
			{
				write_10_date.usStartAddr = 0x213f;
				write_10_date.usLen = 10;
				FLAG_10_UPDATE = 1;
			}
			else if(PRJ_NUMBER == HORNET)
			{
				switch(lubIconSelected)
				{
					case 0:
					{
						write_10_date.usStartAddr = 0x2311;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 1:
					{
						write_10_date.usStartAddr = 0x2326;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 2:
					{
						write_10_date.usStartAddr = 0x233B;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 3:
					{
						write_10_date.usStartAddr = 0x2350;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 4:
					{
						write_10_date.usStartAddr = 0x2365;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 5:
					{
						write_10_date.usStartAddr = 0x237A;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 6:
					{
						write_10_date.usStartAddr = 0x238F;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 7:
					{
						write_10_date.usStartAddr = 0x23A4;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 8:
					{
						write_10_date.usStartAddr = 0x23B9;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
					case 9:
					{
						write_10_date.usStartAddr = 0x23CE;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					break;
				}				
			}
			while(cGetButtonEnter());
			Button.all &= 0x0000;
			lubIconSelected = 0;
			lubInterface = cSetInterface;
		}
		if(PRJ_NUMBER == SUNNYBEE)
		{
			if((luwCurveSet[0] == 0xA9)||(luwCurveSet[0] == 0xAB))
				luwCurveSet[0] = luwCurveSetMin[0];
			if((luwCurveSet[0] == 0x54)||(luwCurveSet[0] == 0x56))
				luwCurveSet[0] = luwCurveSetMax[0];
		}	
	}
	else if(lubInterface == cKeyDataSet)                   //关键数据设置
	{
		sWriteScreenBuf(0,0,20,"KeyData Set         ");
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			if(lubIconSelected <= 1)
			{
				sWriteScreenBuf(1,0,20,(INT8U *)KeyData_Set[lubIconSelected ]);
				sWriteScreenBuf(2,0,20,(INT8U *)KeyData_Set[(1 + lubIconSelected) ]);
				sWriteScreenBuf(3,0,20,(INT8U *)KeyData_Set[(2 + lubIconSelected) ]);
			}
			if(lubIconSelected == 2)
			{
				sWriteScreenBuf(1,0,20,(INT8U *)KeyData_Set[lubIconSelected ]);
				sWriteScreenBuf(2,0,20,(INT8U *)KeyData_Set[(1 + lubIconSelected) ]);
				sWriteScreenBuf(3,0,20,(INT8U *)KeyData_Set[0]);
			}
			if(lubIconSelected == 3)
			{
				sWriteScreenBuf(1,0,20,(INT8U *)KeyData_Set[lubIconSelected ]);
				sWriteScreenBuf(2,0,20,(INT8U *)KeyData_Set[0]);
				sWriteScreenBuf(3,0,20,(INT8U *)KeyData_Set[1]);
			}
		}
		else if(lubBlinkCnt >= 10)
		{
			sWriteScreenBuf(1,0,20,"                    ");
		}
		switch(lubIconSelected)
		{
			case 0:
			{
				switch(luwKeyDataSet[0])
				{
					case 0xAA:
						sWriteScreenBuf(1,15,20,"<YES>");
					break;
					case 0x55:
						sWriteScreenBuf(1,15,20,"< N0>");
					break;
					default:
						sWriteScreenBuf(1,15,20,"<DEF>");
					break;		
				}
				switch(luwKeyDataSet[1])
				{
					case 0xAA:
						sWriteScreenBuf(2,15,20,"<YES>");
					break;
					case 0x55:
						sWriteScreenBuf(2,15,20,"< N0>");
					break;
					default:
						sWriteScreenBuf(2,15,20,"<DEF>");
					break;		
				}
				switch(luwKeyDataSet[2])
				{
					case 0x01:
						sWriteScreenBuf(3,14,20,"Single");
					break;
					case 0x02:
						sWriteScreenBuf(3,14,20,"Double");
					break;
					default:
						sWriteScreenBuf(3,14,20,"<DEF> ");
					break;		
				}
			}
			break;
			case 1:
			{
				switch(luwKeyDataSet[1])
				{
					case 0xAA:
						sWriteScreenBuf(1,15,20,"<YES>");
					break;
					case 0x55:
						sWriteScreenBuf(1,15,20,"< N0>");
					break;
					default:
						sWriteScreenBuf(1,15,20,"<DEF>");
					break;		
				}
				switch(luwKeyDataSet[2])
				{
					case 0x01:
						sWriteScreenBuf(2,14,20,"Single");
					break;
					case 0x02:
						sWriteScreenBuf(2,14,20,"Double");
					break;
					default:
						sWriteScreenBuf(2,14,20,"<DEF> ");
					break;		
				}
				if((luwKeyDataSet[3]&0x8000) == 0)
				{
					sTransferData(0,luwKeyDataSet[3],&lubString[14],5);
					sWriteScreenBuf(3,15,20,&lubString[14]);
				}
				else
				{
					sWriteScreenBuf(3,14,15,"-");
					luwKeyDataSetTemp = 65536-luwKeyDataSet[3];
					sTransferData(0,luwKeyDataSetTemp,&lubString[14],5);
					sWriteScreenBuf(3,15,20,&lubString[14]);
				}
			}
			break;
			case 2:
			{
				switch(luwKeyDataSet[2])
				{
					case 0x01:
						sWriteScreenBuf(1,14,20,"Single");
					break;
					case 0x02:
						sWriteScreenBuf(1,14,20,"Double");
					break;
					default:
						sWriteScreenBuf(1,14,20,"<DEF> ");
					break;		
				}
				if((luwKeyDataSet[3]&0x8000) == 0)
				{
					sTransferData(0,luwKeyDataSet[3],&lubString[14],5);
					sWriteScreenBuf(2,15,20,&lubString[14]);
				}
				else 
				{
					sWriteScreenBuf(2,14,15,"-");
					luwKeyDataSetTemp = 65536-luwKeyDataSet[3];
					sTransferData(0,luwKeyDataSetTemp,&lubString[14],5);
					sWriteScreenBuf(2,15,20,&lubString[14]);
				}
				switch(luwKeyDataSet[0])
				{
					case 0xAA:
						sWriteScreenBuf(3,15,20,"<YES>");
					break;
					case 0x55:
						sWriteScreenBuf(3,15,20,"< N0>");
					break;
					default:
						sWriteScreenBuf(3,15,20,"<DEF>");
					break;		
				}
			}
			break;
			case 3:
			{
				if((luwKeyDataSet[3]&0x8000) == 0)
				{
					sTransferData(0,luwKeyDataSet[3],&lubString[14],5);
					sWriteScreenBuf(1,15,20,&lubString[14]);
				}
				else 
				{
					sWriteScreenBuf(1,14,15,"-");
					luwKeyDataSetTemp = 65536-luwKeyDataSet[3];
					sTransferData(0,luwKeyDataSetTemp,&lubString[14],5);
					sWriteScreenBuf(1,15,20,&lubString[14]);
				}
				switch(luwKeyDataSet[0])
				{
					case 0xAA:
						sWriteScreenBuf(2,15,20,"<YES>");
					break;
					case 0x55:
						sWriteScreenBuf(2,15,20,"< N0>");
					break;
					default:
						sWriteScreenBuf(2,15,20,"<DEF>");
					break;		
				}
				switch(luwKeyDataSet[1])
				{
					case 0xAA:
						sWriteScreenBuf(3,15,20,"<YES>");
					break;
					case 0x55:
						sWriteScreenBuf(3,15,20,"< N0>");
					break;
					default:
						sWriteScreenBuf(3,15,20,"<DEF>");
					break;		
				}
			}
			break;
		}
		if(Button.bit.ubEscPress)												//单击Esc键
		{        
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress || Button.bit.ubUpLongPress)				//单击或长按Up键
		{	        
			if(++luwKeyDataSet[lubIconSelected] > luwKeyDataSetMax[lubIconSelected])
			{
				luwKeyDataSet[lubIconSelected] = luwKeyDataSetMin[lubIconSelected];
			}	
		}
		else if(Button.bit.ubDownPress || Button.bit.ubDownLongPress)			//单击或长按Down键
		{        
			if(--luwKeyDataSet[lubIconSelected] < luwKeyDataSetMin[lubIconSelected])
			{
				luwKeyDataSet[lubIconSelected] = luwKeyDataSetMax[lubIconSelected];
			}
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{        
			lubBlinkCnt = 10;
			if(++lubIconSelected > 3)
			{
				lubIconSelected = 0;
			}
		}
		else if(Button.bit.ubEnterLongPress)									//长按Enter键
		{
			*Key_Data_Info.FcParamRecovery = __REV16(luwKeyDataSet[0]);   //关键数据设置
			*Key_Data_Info.ExistingDataClear = __REV16(luwKeyDataSet[1]);
			*Key_Data_Info.PvInputConnectionMode = __REV16(luwKeyDataSet[2]);
			*Key_Data_Info.TotalElecGenCompVal = __REV16(luwKeyDataSet[3]);
			switch(lubIconSelected)
			{
				case 0:
				{
					if(PRJ_NUMBER == SUNNYBEE)					
						write_10_date.usStartAddr = 0x2108;
					if(PRJ_NUMBER == HORNET)
						write_10_date.usStartAddr = 0x2202;
					write_10_date.usLen = 1;
					FLAG_10_UPDATE = 1;
				}
				break;
				case 1:
				{
					if(PRJ_NUMBER == SUNNYBEE)					
						write_10_date.usStartAddr = 0x210B;
					if(PRJ_NUMBER == HORNET)
						write_10_date.usStartAddr = 0x2203;
					write_10_date.usLen = 1;
					FLAG_10_UPDATE = 1;
				}
				break;
				case 2:
				{
					if(PRJ_NUMBER == SUNNYBEE)					
						write_10_date.usStartAddr = 0x210E;
					if(PRJ_NUMBER == HORNET)
						write_10_date.usStartAddr = 0x2204;
					write_10_date.usLen = 1;
					FLAG_10_UPDATE = 1;
				}
				break;
				case 3:
				{
					if(PRJ_NUMBER == SUNNYBEE)					
						write_10_date.usStartAddr = 0x2111;
					if(PRJ_NUMBER == HORNET)
						write_10_date.usStartAddr = 0x2205;
					write_10_date.usLen = 1;
					FLAG_10_UPDATE = 1;
				}
				break;
			}
			while(cGetButtonEnter());
			Button.all &= 0x0000;
			lubInterface = cSetInterface;
			lubIconSelected = 0;
			
