Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
		}
		if((luwKeyDataSet[0] == 0xA9)||(luwKeyDataSet[0] == 0xAB))
			luwKeyDataSet[0] = luwKeyDataSetMin[0];
		if((luwKeyDataSet[0] == 0x54)||(luwKeyDataSet[0] == 0x56))
			luwKeyDataSet[0] = luwKeyDataSetMax[0];
	
		if((luwKeyDataSet[1] == 0xA9)||(luwKeyDataSet[1] == 0xAB))
			luwKeyDataSet[1] = luwKeyDataSetMin[1];
		if((luwKeyDataSet[1] == 0x54)||(luwKeyDataSet[1] == 0x56))
			luwKeyDataSet[1] = luwKeyDataSetMax[1];		
		
		if(luwKeyDataSet[2] >luwKeyDataSetMax[2])
			luwKeyDataSet[2] = luwKeyDataSetMin[2];
		if(luwKeyDataSet[2] <luwKeyDataSetMin[2])
			luwKeyDataSet[2] = luwKeyDataSetMax[2];
		
		if(luwKeyDataSet[3] >luwKeyDataSetMax[3])
			luwKeyDataSet[3] = luwKeyDataSetMin[3];
		if(luwKeyDataSet[3] <luwKeyDataSetMin[3])
			luwKeyDataSet[3] = luwKeyDataSetMax[3];
	}
	else if(lubInterface == cFreqLimitSet)             //频率上下限设置
	{
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
		}
		strcpy(lubString,"FH:     Hz        Hz");
		if(lubIconSelected != 0 || lubBlinkCnt < 10)
		{
			sTransferData(2,luwFreqSet[0],&lubString[3],4);
		}
		if(lubIconSelected != 1 || lubBlinkCnt < 10)
		{
			sTransferData(2,luwFreqSet[1],&lubString[13],4);
		}
		sWriteScreenBuf(0,0,20,lubString);

			strcpy(lubString,"T :     ms        ms");
			if(lubIconSelected != 2 || lubBlinkCnt < 10)
			{
				sTransferData(0,luwFreqSet[2],&lubString[3],5);
			}
			if(lubIconSelected != 3 || lubBlinkCnt < 10)
			{
				sTransferData(0,luwFreqSet[3],&lubString[13],5);
			}
		
		sDisplayAsist(3,7,lubString);
		sDisplayAsist(13,17,lubString);
		sWriteScreenBuf(1,0,20,lubString);
		
		strcpy(lubString,"FL:     Hz        Hz");
		if(lubIconSelected != 4 || lubBlinkCnt < 10)
		{
			sTransferData(2,luwFreqSet[4],&lubString[3],4);
		}
		if(lubIconSelected != 5 || lubBlinkCnt < 10)
		{
			sTransferData(2,luwFreqSet[5],&lubString[13],4);
		}
		sWriteScreenBuf(2,0,20,lubString);
		
			strcpy(lubString,"T :     ms        ms");
			if(lubIconSelected != 6 || lubBlinkCnt < 10)
			{
				sTransferData(0,luwFreqSet[6],&lubString[3],5);
			}
			if(lubIconSelected != 7 || lubBlinkCnt < 10)
			{
				sTransferData(0,luwFreqSet[7],&lubString[13],5);
			}
		

		sDisplayAsist(3,7,lubString);
		sDisplayAsist(13,17,lubString);
		sWriteScreenBuf(3,0,20,lubString);
		
		if(Button.bit.ubEscPress)												//单击Esc键
		{        
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress || Button.bit.ubUpLongPress)				//单击或长按Up键
		{        
			if(++luwFreqSet[lubIconSelected] > luwFreqSetMax[lubIconSelected])
			{
				luwFreqSet[lubIconSelected] = luwFreqSetMin[lubIconSelected];
			}
		}
		else if(Button.bit.ubDownPress || Button.bit.ubDownLongPress)			//单击或长按Down键
		{	        
			if(--luwFreqSet[lubIconSelected] < luwFreqSetMin[lubIconSelected])
			{
				luwFreqSet[lubIconSelected] = luwFreqSetMax[lubIconSelected];
			}
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{        
			if(++lubIconSelected >= 8)
			{
				lubIconSelected = 0;
			}
		}
		else if(Button.bit.ubEnterLongPress)									//长按Enter键
		{
				
				Safty.data.uwFreqHigh[0] = __REV16(luwFreqSet[0]);
				Safty.data.uwFreqHigh[1] = __REV16(luwFreqSet[1]);
				Safty.data.uwFreqHighCnt[0] = __REV16(luwFreqSet[2]);	
				Safty.data.uwFreqHighCnt[1] = __REV16(luwFreqSet[3]);
				Safty.data.uwFreqLow[0] = __REV16(luwFreqSet[4]);
				Safty.data.uwFreqLow[1] = __REV16(luwFreqSet[5]);
				Safty.data.uwFreqLowCnt[0] = __REV16(luwFreqSet[6]);
				Safty.data.uwFreqLowCnt[1] = __REV16(luwFreqSet[7]);				
				if(PRJ_NUMBER == SUNNYBEE)
				{
					memcpy(MF_afGridFreqProtThresHigh,Safty.data.uwFreqHigh,4);   //频率上下限
					memcpy(MF_ausGridFreqProtTimeHigh,Safty.data.uwFreqHighCnt,4);
					memcpy(MF_afGridFreqProtThresLow,Safty.data.uwFreqLow,4);
					memcpy(MF_ausGridFreqProtTimeLow,Safty.data.uwFreqLowCnt,4);
					write_10_date.usStartAddr = 0x2132;
					write_10_date.usLen = 12;
					FLAG_10_UPDATE = 1;
				}
				else if(PRJ_NUMBER == HORNET)
				{
					memcpy(HF_afGridFreqProtThresHigh,Safty.data.uwFreqHigh,4);   //频率上下限
					memcpy(HF_ausGridFreqProtTimeHigh,Safty.data.uwFreqHighCnt,4);
					memcpy(HF_afGridFreqProtThresLow,Safty.data.uwFreqLow,4);
					memcpy(HF_ausGridFreqProtTimeLow,Safty.data.uwFreqLowCnt,4);
					write_10_date.usStartAddr = 0x2113;
					write_10_date.usLen = 14;
					FLAG_10_UPDATE = 1;
				}
				while(cGetButtonEnter());
				Button.all &= 0x0000;
				lubIconSelected = 0;
				lubInterface = cSetInterface;
		}
		
	}
	else if(lubInterface == cVoltLimitSet)       //电压上下限设置
	{
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
		}
		strcpy(lubString,"VH:     V         V ");
		if(lubIconSelected != 0 || lubBlinkCnt < 10)
		{
			sTransferData(1,luwVoltSet[0],&lubString[3],4);
		}
		if(lubIconSelected != 1 || lubBlinkCnt < 10)
		{
			sTransferData(1,luwVoltSet[1],&lubString[13],4);
		}
		sWriteScreenBuf(0,0,20,lubString);
		
		strcpy(lubString,"T :     ms        ms");
		if(lubIconSelected != 2 || lubBlinkCnt < 10)
		{
			sTransferData(0,luwVoltSet[2],&lubString[3],5);
		}
		if(lubIconSelected != 3 || lubBlinkCnt < 10)
		{
			sTransferData(0,luwVoltSet[3],&lubString[13],5);
		}
		sDisplayAsist(3,7,lubString);
		sDisplayAsist(13,17,lubString);
		sWriteScreenBuf(1,0,20,lubString);
		
		strcpy(lubString,"VL:     V         V ");
		if(lubIconSelected != 4 || lubBlinkCnt < 10)
		{
			sTransferData(1,luwVoltSet[4],&lubString[3],4);
		}
		if(lubIconSelected != 5 || lubBlinkCnt < 10)
		{
			sTransferData(1,luwVoltSet[5],&lubString[13],4);		
		}
		sDisplayAsist(13,17,lubString);
		sWriteScreenBuf(2,0,20,lubString);
		
		strcpy(lubString,"T :     ms        ms");
		if(lubIconSelected != 6 || lubBlinkCnt < 10)
		{
			sTransferData(0,luwVoltSet[6],&lubString[3],5);
		}
		if(lubIconSelected != 7 || lubBlinkCnt < 10)
		{
			sTransferData(0,luwVoltSet[7],&lubString[13],5);
		}
		sDisplayAsist(3,7,lubString);
		sDisplayAsist(13,17,lubString);
		sWriteScreenBuf(3,0,20,lubString);
		
		if(Button.bit.ubEscPress)												//单击Esc键
		{        
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress || Button.bit.ubUpLongPress)				//单击或长按Up键
		{	        
			if(++luwVoltSet[lubIconSelected] > luwVoltSetMax[lubIconSelected])
			{
				luwVoltSet[lubIconSelected] = luwVoltSetMin[lubIconSelected];
			}
		}
		else if(Button.bit.ubDownPress || Button.bit.ubDownLongPress)			//单击或长按Down键
		{        
			if(--luwVoltSet[lubIconSelected] < luwVoltSetMin[lubIconSelected])
			{
				luwVoltSet[lubIconSelected] = luwVoltSetMax[lubIconSelected];
			}
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{        
			if(++lubIconSelected >= 8)
			{
				lubIconSelected = 0;
			}
		}
		else if(Button.bit.ubEnterLongPress)									//长按Enter键
		{
				
				Safty.data.uwGridVoltHigh[0] = __REV16(luwVoltSet[0]);
				Safty.data.uwGridVoltHigh[1] =  __REV16(luwVoltSet[1]);
				Safty.data.uwGridVoltHighCnt[0] =  __REV16(luwVoltSet[2]);
				Safty.data.uwGridVoltHighCnt[1] =  __REV16(luwVoltSet[3]);
				Safty.data.uwGridVoltLow[0] =  __REV16(luwVoltSet[4]);
				Safty.data.uwGridVoltLow[1] =  __REV16(luwVoltSet[5]);
				Safty.data.uwGridVoltLowCnt[0] =  __REV16(luwVoltSet[6]);
				Safty.data.uwGridVoltLowCnt[1] =  __REV16(luwVoltSet[7]);
				
