Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
				if(PRJ_NUMBER == SUNNYBEE)
				{
					memcpy(MF_afGridVoltProtThresHigh,Safty.data.uwGridVoltHigh,4);   //电压上下限
					memcpy(MF_ausGridVoltProtTimeHigh,Safty.data.uwGridVoltHighCnt,4);
					memcpy(MF_afGridVoltProtThresLow,Safty.data.uwGridVoltLow,4);
					memcpy(MF_ausGridVoltProtTimeLow,Safty.data.uwGridVoltLowCnt,4);
					write_10_date.usStartAddr = 0x2125;
					write_10_date.usLen = 12;
					FLAG_10_UPDATE = 1;
				}
				else if(PRJ_NUMBER == HORNET)
				{
					memcpy(HF_afGridVoltProtThresHigh,Safty.data.uwGridVoltHigh,4);   //电压上下限
					memcpy(HF_ausGridVoltProtTimeHigh,Safty.data.uwGridVoltHighCnt,4);
					memcpy(HF_afGridVoltProtThresLow,Safty.data.uwGridVoltLow,4);
					memcpy(HF_ausGridVoltProtTimeLow,Safty.data.uwGridVoltLowCnt,4);
					write_10_date.usStartAddr = 0x2104;
					write_10_date.usLen = 14;
					FLAG_10_UPDATE = 1;
				}
				while(cGetButtonEnter());
				Button.all &= 0x0000;
				lubIconSelected = 0;
				lubInterface = cSetInterface;
		}
		
	}
	else if(lubInterface == cPasswordIn)
	{
		sWriteScreenBuf(0,0,20,"                    ");
		sWriteScreenBuf(1,0,11,(INT8U *)lubSetListDisplay[Info.data.ublanguage][4] + 1);
		sWriteScreenBuf(1,11,9,"         ");
		strcpy(lubString,"                    ");
				
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
		}	
		if(lubIconSelected != 0 || lubBlinkCnt < 10)
		{
			lubString[6] = lubPasswordIn[0];
		}
		if(lubIconSelected != 1 || lubBlinkCnt < 10)
		{
			lubString[7] = lubPasswordIn[1];
		}
		if(lubIconSelected != 2 || lubBlinkCnt < 10)
		{
			lubString[8] = lubPasswordIn[2];
		}
		if(lubIconSelected != 3 || lubBlinkCnt < 10)
		{
			lubString[9] = lubPasswordIn[3];
		}
		if(lubIconSelected != 4 || lubBlinkCnt < 10)
		{
			lubString[10] = lubPasswordIn[4];
		}
		if(lubIconSelected != 5 || lubBlinkCnt < 10)
		{
			lubString[11] = lubPasswordIn[5];
		}
		sWriteScreenBuf(2,0,20,lubString);		
		sWriteScreenBuf(3,0,20,"                    ");
		
		if(Button.bit.ubEscPress)												//单击Esc键
		{
			for(i = 0;i < 6;i++)
			{
				lubPasswordIn[i] = 0x30;
			}
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress)											//单击Up键
		{       
			if(++lubPasswordIn[lubIconSelected] > 0x39)
			{
				lubPasswordIn[lubIconSelected] = 0x30;
			}
		}
		else if(Button.bit.ubDownPress)											//单击Down键
		{	        
			if(--lubPasswordIn[lubIconSelected] < 0x30)
			{
				lubPasswordIn[lubIconSelected] = 0x39;
			}
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{			    
			lubBlinkCnt = 10;					
			if(++lubIconSelected >= 6)
			{
				lubIconSelected = 0;
				if(Info.data.ubPasswordH == (lubPasswordIn[0] - 0x30) * 16 + lubPasswordIn[1] - 0x30
				&& Info.data.ubPasswordM == (lubPasswordIn[2] - 0x30) * 16 + lubPasswordIn[3] - 0x30
				&& Info.data.ubPasswordL == (lubPasswordIn[4] - 0x30) * 16 + lubPasswordIn[5] - 0x30)
				{
					lubInterface = lubInterfacePre;
				}
				else
				{
					lubInterface = cPasswordIn;
				}
				for(i = 0;i < 6;i++)
				{
					lubPasswordIn[i] = 0x30;
				}
			}
		}
	}
	else if(lubInterface == cPasswordSaved)
	{
		sWriteScreenBuf(0,0,20,"                    ");
		sWriteScreenBuf(1,0,20,"Password is saved!  ");
		strcpy(lubString,"                    ");
		lubString[6] = ((Info.data.ubPasswordH >> 4)& 0x0f) + 0x30;
		lubString[7] = (Info.data.ubPasswordH & 0x0f) + 0x30;
		lubString[8] = ((Info.data.ubPasswordM >> 4)& 0x0f) + 0x30;
		lubString[9] = (Info.data.ubPasswordM & 0x0f) + 0x30;
		lubString[10] = ((Info.data.ubPasswordL >> 4)& 0x0f) + 0x30;
		lubString[11] = (Info.data.ubPasswordL & 0x0f) + 0x30;
		sWriteScreenBuf(2,0,20,lubString);
		sWriteScreenBuf(3,0,20,"                    ");
		
		if(Button.all & 0xF0)
		{
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		
	}
	else if(lubInterface == cAutoTestPage)
	{
		if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
		{
			AutoTest_Info.Trip_Value = __REV16(MF_SelfTest[Italy_SelfTest_Flag-1].Trip_Value);    //意大利自检
			AutoTest_Info.Trip_Time = __REV16(MF_SelfTest[Italy_SelfTest_Flag-1].Trip_Time);    //意大利自检
			AutoTest_Info.State = __REV16(MF_SelfTestState);    //意大利自检
		}

		luwNoOprateCnt = 0;
		sWriteScreenBuf(0,0,20,"Auto Test:          ");
		sWriteScreenBuf(1,0,20,lubStringTemp);	
		
		luwAutoTestTemp1 = sAutoTestAsis1(1,lubIconSelected,AutoTest_Info.Trip_Value);
		luwAutoTestTemp2 = sAutoTestAsis1(2,lubIconSelected,AutoTest_Info.Trip_Time);
		if((lubIconSelected <= 4) && (lubIconSelected > 0))
		{
			strcpy(lubString,"        V       ms  ");	
			if(luwAutoTestCnt < 400)
			{
				sTransferData(1,luwAutoTestTemp1,&lubString[3],4);
				sDisplayAsist(3,6,lubString);			
			}
			else
			{
				luwAutoTestTemp1 = 0;
				luwAutoTestTemp2 = 0;
				sTransferData(1,luwAutoTestTemp1,&lubString[5],2);		
			}
		}	
		else if((lubIconSelected >= 5) && (lubIconSelected <= 8))
		{
			strcpy(lubString,"        Hz      ms  ");	
			if(luwAutoTestCnt < 400)
			{
				sTransferData(2,(luwAutoTestTemp1/10),&lubString[3],4);
				sDisplayAsist(3,6,lubString);
			}
			else
			{
				luwAutoTestTemp1 = 0;
				luwAutoTestTemp2 = 0;
				sTransferData(2,(luwAutoTestTemp1/10),&lubString[4],3);
			}
		}		
	
		sTransferData(0,luwAutoTestTemp2,&lubString[12],4);
		sDisplayAsist(12,15,lubString);
		sWriteScreenBuf(2,0,20,lubString);	
		sWriteScreenBuf(3,0,20,"Status:             ");
		if(AutoTest_Info.State == 0xAA)	
		{
			luwAutoTestCnt = 0;
			sWriteScreenBuf(3,0,20,"Status:SelfTest  OK ");
		}
		else
		{
			if(AutoTest_Info.State == 0x55)	
			{
				luwAutoTestCnt = 0;
				sWriteScreenBuf(3,0,20,"Status:SelfTest Fail");
			}
			else
			{
				if(AutoTest_Info.State == 0xA2)	
				{
					luwAutoTestCnt = 0;
					sWriteScreenBuf(3,0,20,"Status:   waiting   ");
				}
			}
		
		}	 
		if((++luwAutoTestCnt >= 400) && (INV_StateFlag == 4))
		{
			luwAutoTestCnt = 400;
			sWriteScreenBuf(3,0,20,"Status:  Time Out   ");
		}
		if(Button.bit.ubEscPress)	
		{
			SlaveData.data.SlaveFlag.bit.ubSelfTestStep = 1;
			luwAutoTestCnt = 0;
			lubInterface = lubInterfacePre;
			lubIconSelected = 0;
			MF_usItalySelfTestEn = 0x00;
			write_10_date.usStartAddr = 0x214D;
			write_10_date.usLen = 1;
			FLAG_10_UPDATE = 1;
		}
	} 
	else if(lubInterface == cInvSet)                    //逆变器设置
	{
		sWriteScreenBuf(0,0,20,"Inv Set             ");
		if(++lubBlinkCnt >= 20)
		{
			lubBlinkCnt = 0;
			sWriteScreenBuf(1,0,20,(INT8U *)Inv_Set[0]);
			sWriteScreenBuf(2,0,20,(INT8U *)Inv_Set[1]);
			sWriteScreenBuf(3,0,20,"                    ");
		}
		else if(lubBlinkCnt >= 10)
		{
			switch(lubIconSelected)
			{
				case 0:
					sWriteScreenBuf(1,0,20,"                    ");
				break;
				case 1:
					sWriteScreenBuf(2,0,20,"                    ");
				break;
			}
		}
		switch(luwInvSet[0])
		{
			case 0xAF:
				sWriteScreenBuf(1,15,20,"<YES>");
			break;
			case 0xAE:
				sWriteScreenBuf(1,15,20,"< N0>");
			break;
			default:
				sWriteScreenBuf(1,15,20,"<DEF>");
			break;		
		}
		sTransferData(0,luwInvSet[1],&lubString[16],4);
		sWriteScreenBuf(2,16,20,&lubString[16]);
		if(Button.bit.ubEscPress)												//单击Esc键
		{        
			lubInterface = cSetInterface;
			lubIconSelected = 0;
		}
		else if(Button.bit.ubUpPress || Button.bit.ubUpLongPress)				//单击或长按Up键
		{	        
			if(++luwInvSet[lubIconSelected] > luwInvSetMax[lubIconSelected])
			{
				luwInvSet[lubIconSelected] = luwInvSetMin[lubIconSelected];
			}	
		}
		else if(Button.bit.ubDownPress || Button.bit.ubDownLongPress)			//单击或长按Down键
		{        
			if(--luwInvSet[lubIconSelected] < luwInvSetMin[lubIconSelected])
			{
				luwInvSet[lubIconSelected] = luwInvSetMax[lubIconSelected];
			}
		}
		else if(Button.bit.ubEnterPress)										//单击Enter键
		{        
			lubBlinkCnt = 10;
			if(++lubIconSelected > 1)
			{
				lubIconSelected = 0;
			}
		}
		else if(Button.bit.ubEnterLongPress)									//长按Enter键
		{
			*INV_Set_Info.InvOnOffCmd = __REV16(luwInvSet[0]);  //逆变器设置
			*INV_Set_Info.WaitStandupTime = __REV16(luwInvSet[1]);
			switch(lubIconSelected)
			{
				case 0:
				{
					if(PRJ_NUMBER == SUNNYBEE)
					{
						write_10_date.usStartAddr = 0x2119;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					else if(PRJ_NUMBER == HORNET)
					{
						write_10_date.usStartAddr = 0x2287;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
				}
				break;
				case 1:
				{
					if(PRJ_NUMBER == SUNNYBEE)
					{
						write_10_date.usStartAddr = 0x211A;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
					else if(PRJ_NUMBER == HORNET)
					{
						write_10_date.usStartAddr = 0x2127;
						write_10_date.usLen = 1;
						FLAG_10_UPDATE = 1;
					}
				}
				break;
			}
			while(cGetButtonEnter());
			Button.all &= 0x0000;
			lubInterface = cSetInterface;
			lubIconSelected = 0;			
		}
		if(luwInvSet[1] > luwInvSetMax[1])
			luwInvSet[1] = luwInvSetMax[1];
	}
	else
	{
		lubInterface = cDefaultInterface;
		lubIconSelected = 0;
	}
}

/*****************************************************************************
 * 函数名称：自检辅助函数1
 * 函数输入：自检模式，自检项目，自检值
 * 函数返回值：自检值
 * 函数描述：
 ****************************************************************************/
INT16U sAutoTestAsis1(INT8U lubModel,INT8U lubItem,INT16U luwValue)
{
	INT16U luwAutoTestAsisTemp;

	if(luwValue > 0)
	{
		luwAutoTestAsisTemp = luwValue;
	}
	else
	{
		if(lubItem < 3)
		{
			if(lubModel == 1)
			{
				luwAutoTestAsisTemp = Safty.data.uwGridVoltHigh[lubItem - 1];
			}
			else if(lubModel == 2)
			{
				luwAutoTestAsisTemp = Safty.data.uwGridVoltHighCnt[lubItem - 1] * 10; 
			}
		}
		else if(lubItem < 5)
		{
			if(lubModel == 1)
			{
				luwAutoTestAsisTemp = Safty.data.uwGridVoltLow[lubItem - 3];
			}
			else if(lubModel == 2)
			{
				luwAutoTestAsisTemp = Safty.data.uwGridVoltLowCnt[lubItem - 3] * 10; 
			}
			
