Look-up-the-sky/External-LCD-STM32f070-/App/Display.c
		}
		else if(lubItem < 7)
		{
			if(lubModel == 1)
			{
				luwAutoTestAsisTemp = Safty.data.uwFreqHigh[lubItem - 5]; 
			}
			else if(lubModel == 2)
			{
				luwAutoTestAsisTemp = Safty.data.uwFreqHighCnt[lubItem - 5] * 10; 
			}
		}
		else if(lubIconSelected < 9)
		{
			if(lubModel == 1)
			{
				luwAutoTestAsisTemp = Safty.data.uwFreqLow[lubItem - 7]; 
			}
			else if(lubModel == 2)
			{
				luwAutoTestAsisTemp = Safty.data.uwFreqLowCnt[lubItem - 7] * 10; 
			}
		}
	}
	
	return luwAutoTestAsisTemp;
}

/*****************************************************************************
 * 函数名称：自检辅助函数
 * 函数输入：自检模式
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sAutoTestAsis(INT8U lubModel)
{
	if(++lubBlinkCnt >= 20)
	{
		lubBlinkCnt = 0;
	}
	
	sWriteScreenBuf(0,0,20,"Auto Test:          ");
	sWriteScreenBuf(1,0,20,"Select Item         ");
	
	if(lubPageFlg != 1)
	{
		strcpy(lubString,"   27.S1    27.S2   ");
		
		if(lubIconSelected == 1 && lubBlinkCnt > 10)
		{
			strcpy(lubString,"        ");
		}
		if(lubIconSelected == 2 && lubBlinkCnt > 10)
		{
			strcpy(&lubString[8],"            ");
		}
		sWriteScreenBuf(2,0,20,lubString);
		
		strcpy(lubString,"   59.S1    59.S2   ");
		if(lubIconSelected == 3 && lubBlinkCnt > 10)
		{
			strcpy(lubString,"        ");
		}
		if(lubIconSelected == 4 && lubBlinkCnt > 10)
		{
			strcpy(&lubString[8],"            ");
		}
		sWriteScreenBuf(3,0,20,lubString);
	}
	else
	{
		strcpy(lubString,"   81<.S1   81<.S2  ");
		if(lubIconSelected == 5 && lubBlinkCnt > 10)
		{
			strcpy(lubString,"        ");
		}
		if(lubIconSelected == 6 && lubBlinkCnt > 10)
		{
			strcpy(&lubString[8],"            ");
		}
		sWriteScreenBuf(2,0,20,lubString);
		
		strcpy(lubString,"   81>.S1   81>.S2  ");
		if(lubIconSelected == 7 && lubBlinkCnt > 10)
		{
			strcpy(lubString,"        ");
		}
		if(lubIconSelected == 8 && lubBlinkCnt > 10)
		{
			strcpy(&lubString[8],"            ");
		}
		sWriteScreenBuf(3,0,20,lubString);
	}
	
	
	if(Button.bit.ubEnterPress)
	{
		lubInterface = cAutoTestPage;
		if(lubIconSelected == 1)
		{
			strcpy(lubStringTemp,"  27.S1             ");
		}
		else if(lubIconSelected == 2)
		{
			strcpy(lubStringTemp,"  27.S2             ");
		}
		else if(lubIconSelected == 3)
		{
			strcpy(lubStringTemp,"  59.S1             ");
		}
		else if(lubIconSelected == 4)
		{
			strcpy(lubStringTemp,"  59.S2             ");
		}
		else if(lubIconSelected == 5)
		{
			strcpy(lubStringTemp,"  81<.S1            ");
		}
		else if(lubIconSelected == 6)
		{
			strcpy(lubStringTemp,"  81<.S2            ");
		}
		else if(lubIconSelected == 7)
		{
			strcpy(lubStringTemp,"  81>.S1            ");
		}
		else if(lubIconSelected == 8)
		{
			strcpy(lubStringTemp,"  81>.S2            ");
		}
		else
		{
			lubInterface = lubInterfacePre;
		}
		Italy_SelfTest_Flag = lubIconSelected;
		MF_usItalySelfTestEn = __REV16(lubIconSelected);
		write_10_date.usStartAddr = 0x214D;
		write_10_date.usLen = 1;
		FLAG_10_UPDATE = 1;
		
		lubPageFlg = 0;
	}
	else if(Button.bit.ubUpPress)
	{
		if(--lubIconSelected > 8)
		{
			lubPageFlg = 0;
			lubIconSelected = 8;
		}
	}
	else if(Button.bit.ubDownPress)
	{
		if(++lubIconSelected > 8)
		{
			lubPageFlg = 1;
			lubIconSelected = 1;
		}
	}
	else if(Button.bit.ubEscPress)
	{
		lubPageFlg = 0;
		lubIconSelected = 0;
		lubInterface = cSetInterface;
	}
	
	if(lubIconSelected > 4)
	{
		lubPageFlg = 1;
	}
	else
	{
		lubPageFlg = 0;
	}
}
/*****************************************************************************
 * 函数名称：写LCD地址函数
 * 函数输入：地址
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sWriteLCDAdr(INT8U lubLCDAdr)
{
	while(sGetLCDState())
	{
		if(++luwBusyCheckCnt >= 9000)
		break;
	}
	luwBusyCheckCnt = 0;
	sWriteLCDData(0x80 | lubLCDAdr,0);
}

/*****************************************************************************
 * 函数名称：界面更新函数
 * 函数输入：无
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sUpdateLCD(void)
{
	INT8U lubLine;
	INT8U lubRow;
	for(lubLine = 0;lubLine < cMaxLine;lubLine++)
	{
		for(lubRow = 0;lubRow < cMaxRow;lubRow++)
		{
			sWriteLCDAdr(lubLCDAdr[lubLine] + lubRow);
			while(sGetLCDState())
			{
				if(++luwBusyCheckCnt >= 9000)
				break;
			}
			luwBusyCheckCnt = 0;
			sWriteLCDData(lubScreenBuf[lubLine][lubRow],1);
		}
	}
}


/*****************************************************************************
 * 函数名称：数据转化函数函数
 * 函数输入：小数点位置，带转化数值，缓存首地址，可用缓存长度
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sTransferData(INT8U lubDot,INT32U lulData,INT8U *lubDataP,INT8U lubLength)
{
	INT8U i;
	
	if(lubLength < 9)
	{
		for(i = lubLength;i > 0;i--)
		{
			lulData %= c10Time[i];
			lubDataP[lubLength - i] = lulData / c10Time[i - 1] + 0x30;
		}
		
		if(lubDot && lubDot < lubLength)
		{
			for(i = lubLength;i > lubLength - lubDot;i--)
			{
				lubDataP[i] = lubDataP[i - 1];
			}
			lubDataP[lubLength - lubDot] = '.';
		}
	}
}

/*****************************************************************************
 * 函数名称：辅助显示函数
 * 函数输入：辅助显示的起始列数，终止列数，字符串内容?
 * 函数返回值：无
 * 函数描述：
 ****************************************************************************/
void sDisplayAsist(INT8U lubMin,INT8U lubMax,INT8U *lubStringAsist)
{
	INT8U i,j;

	j = 0;
	for(i = lubMin;i < lubMax;i++)
	{
		if(lubStringAsist[i] == '0')
			j ++;
		else
			break;
	}
	
	for(i = lubMin;i < (lubMin + j);i++)
		lubStringAsist[i] = ' ';
}

/*****************************************************************************
 * 函数名称：故障代码计算函数
 * 函数输入：故障值
 * 函数返回值：故障位
 * 函数描述：
 ****************************************************************************/
INT8U sCalFaultValue(INT32U lulError)
{
	INT8U i;

	for(i = 0;i < 32;i++)
	{
		if(lulError & 0x01)
		{
			lulError = i;
			break;
		}
		lulError >>= 1;
	}
	return(i);
}
